mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xj/common/s6e2c4xj.h
typedef struct stc_hsspi_txfifo6_field
{
    union {
        struct {
            __IO  uint32_t  TXDATA               :32;
        };
        struct {
            __IO  uint32_t  TXDATA0              :1;
            __IO  uint32_t  TXDATA1              :1;
            __IO  uint32_t  TXDATA2              :1;
            __IO  uint32_t  TXDATA3              :1;
            __IO  uint32_t  TXDATA4              :1;
            __IO  uint32_t  TXDATA5              :1;
            __IO  uint32_t  TXDATA6              :1;
            __IO  uint32_t  TXDATA7              :1;
            __IO  uint32_t  TXDATA8              :1;
            __IO  uint32_t  TXDATA9              :1;
            __IO  uint32_t  TXDATA10             :1;
            __IO  uint32_t  TXDATA11             :1;
            __IO  uint32_t  TXDATA12             :1;
            __IO  uint32_t  TXDATA13             :1;
            __IO  uint32_t  TXDATA14             :1;
            __IO  uint32_t  TXDATA15             :1;
            __IO  uint32_t  TXDATA16             :1;
            __IO  uint32_t  TXDATA17             :1;
            __IO  uint32_t  TXDATA18             :1;
            __IO  uint32_t  TXDATA19             :1;
            __IO  uint32_t  TXDATA20             :1;
            __IO  uint32_t  TXDATA21             :1;
            __IO  uint32_t  TXDATA22             :1;
            __IO  uint32_t  TXDATA23             :1;
            __IO  uint32_t  TXDATA24             :1;
            __IO  uint32_t  TXDATA25             :1;
            __IO  uint32_t  TXDATA26             :1;
            __IO  uint32_t  TXDATA27             :1;
            __IO  uint32_t  TXDATA28             :1;
            __IO  uint32_t  TXDATA29             :1;
            __IO  uint32_t  TXDATA30             :1;
            __IO  uint32_t  TXDATA31             :1;
        };
    };
} stc_hsspi_txfifo6_field_t;

typedef struct stc_hsspi_txfifo7_field
{
    union {
        struct {
            __IO  uint32_t  TXDATA               :32;
        };
        struct {
            __IO  uint32_t  TXDATA0              :1;
            __IO  uint32_t  TXDATA1              :1;
            __IO  uint32_t  TXDATA2              :1;
            __IO  uint32_t  TXDATA3              :1;
            __IO  uint32_t  TXDATA4              :1;
            __IO  uint32_t  TXDATA5              :1;
            __IO  uint32_t  TXDATA6              :1;
            __IO  uint32_t  TXDATA7              :1;
            __IO  uint32_t  TXDATA8              :1;
            __IO  uint32_t  TXDATA9              :1;
            __IO  uint32_t  TXDATA10             :1;
            __IO  uint32_t  TXDATA11             :1;
            __IO  uint32_t  TXDATA12             :1;
            __IO  uint32_t  TXDATA13             :1;
            __IO  uint32_t  TXDATA14             :1;
            __IO  uint32_t  TXDATA15             :1;
            __IO  uint32_t  TXDATA16             :1;
            __IO  uint32_t  TXDATA17             :1;
            __IO  uint32_t  TXDATA18             :1;
            __IO  uint32_t  TXDATA19             :1;
            __IO  uint32_t  TXDATA20             :1;
            __IO  uint32_t  TXDATA21             :1;
            __IO  uint32_t  TXDATA22             :1;
            __IO  uint32_t  TXDATA23             :1;
            __IO  uint32_t  TXDATA24             :1;
            __IO  uint32_t  TXDATA25             :1;
            __IO  uint32_t  TXDATA26             :1;
            __IO  uint32_t  TXDATA27             :1;
            __IO  uint32_t  TXDATA28             :1;
            __IO  uint32_t  TXDATA29             :1;
            __IO  uint32_t  TXDATA30             :1;
            __IO  uint32_t  TXDATA31             :1;
        };
    };
} stc_hsspi_txfifo7_field_t;

typedef struct stc_hsspi_txfifo8_field
{
    union {
        struct {
            __IO  uint32_t  TXDATA               :32;
        };
        struct {
            __IO  uint32_t  TXDATA0              :1;
            __IO  uint32_t  TXDATA1              :1;
            __IO  uint32_t  TXDATA2              :1;
            __IO  uint32_t  TXDATA3              :1;
            __IO  uint32_t  TXDATA4              :1;
            __IO  uint32_t  TXDATA5              :1;
            __IO  uint32_t  TXDATA6              :1;
            __IO  uint32_t  TXDATA7              :1;
            __IO  uint32_t  TXDATA8              :1;
            __IO  uint32_t  TXDATA9              :1;
            __IO  uint32_t  TXDATA10             :1;
            __IO  uint32_t  TXDATA11             :1;
            __IO  uint32_t  TXDATA12             :1;
            __IO  uint32_t  TXDATA13             :1;
            __IO  uint32_t  TXDATA14             :1;
            __IO  uint32_t  TXDATA15             :1;
            __IO  uint32_t  TXDATA16             :1;
            __IO  uint32_t  TXDATA17             :1;
            __IO  uint32_t  TXDATA18             :1;
            __IO  uint32_t  TXDATA19             :1;
            __IO  uint32_t  TXDATA20             :1;
            __IO  uint32_t  TXDATA21             :1;
            __IO  uint32_t  TXDATA22             :1;
            __IO  uint32_t  TXDATA23             :1;
            __IO  uint32_t  TXDATA24             :1;
            __IO  uint32_t  TXDATA25             :1;
            __IO  uint32_t  TXDATA26             :1;
            __IO  uint32_t  TXDATA27             :1;
            __IO  uint32_t  TXDATA28             :1;
            __IO  uint32_t  TXDATA29             :1;
            __IO  uint32_t  TXDATA30             :1;
            __IO  uint32_t  TXDATA31             :1;
        };
    };
} stc_hsspi_txfifo8_field_t;

typedef struct stc_hsspi_txfifo9_field
{
    union {
        struct {
            __IO  uint32_t  TXDATA               :32;
        };
        struct {
            __IO  uint32_t  TXDATA0              :1;
            __IO  uint32_t  TXDATA1              :1;
            __IO  uint32_t  TXDATA2              :1;
            __IO  uint32_t  TXDATA3              :1;
            __IO  uint32_t  TXDATA4              :1;
            __IO  uint32_t  TXDATA5              :1;
            __IO  uint32_t  TXDATA6              :1;
            __IO  uint32_t  TXDATA7              :1;
            __IO  uint32_t  TXDATA8              :1;
            __IO  uint32_t  TXDATA9              :1;
            __IO  uint32_t  TXDATA10             :1;
            __IO  uint32_t  TXDATA11             :1;
            __IO  uint32_t  TXDATA12             :1;
            __IO  uint32_t  TXDATA13             :1;
            __IO  uint32_t  TXDATA14             :1;
            __IO  uint32_t  TXDATA15             :1;
            __IO  uint32_t  TXDATA16             :1;
            __IO  uint32_t  TXDATA17             :1;
            __IO  uint32_t  TXDATA18             :1;
            __IO  uint32_t  TXDATA19             :1;
            __IO  uint32_t  TXDATA20             :1;
            __IO  uint32_t  TXDATA21             :1;
            __IO  uint32_t  TXDATA22             :1;
            __IO  uint32_t  TXDATA23             :1;
            __IO  uint32_t  TXDATA24             :1;
            __IO  uint32_t  TXDATA25             :1;
            __IO  uint32_t  TXDATA26             :1;
            __IO  uint32_t  TXDATA27             :1;
            __IO  uint32_t  TXDATA28             :1;
            __IO  uint32_t  TXDATA29             :1;
            __IO  uint32_t  TXDATA30             :1;
            __IO  uint32_t  TXDATA31             :1;
        };
    };
} stc_hsspi_txfifo9_field_t;

typedef struct stc_hsspi_txfifo10_field
{
    union {
        struct {
            __IO  uint32_t  TXDATA               :32;
        };
        struct {
            __IO  uint32_t  TXDATA0              :1;
            __IO  uint32_t  TXDATA1              :1;
            __IO  uint32_t  TXDATA2              :1;
            __IO  uint32_t  TXDATA3              :1;
            __IO  uint32_t  TXDATA4              :1;
            __IO  uint32_t  TXDATA5              :1;
            __IO  uint32_t  TXDATA6              :1;
            __IO  uint32_t  TXDATA7              :1;
            __IO  uint32_t  TXDATA8              :1;
            __IO  uint32_t  TXDATA9              :1;
            __IO  uint32_t  TXDATA10             :1;
            __IO  uint32_t  TXDATA11             :1;
            __IO  uint32_t  TXDATA12             :1;
            __IO  uint32_t  TXDATA13             :1;
            __IO  uint32_t  TXDATA14             :1;
            __IO  uint32_t  TXDATA15             :1;
            __IO  uint32_t  TXDATA16             :1;
            __IO  uint32_t  TXDATA17             :1;
            __IO  uint32_t  TXDATA18             :1;
            __IO  uint32_t  TXDATA19             :1;
            __IO  uint32_t  TXDATA20             :1;
            __IO  uint32_t  TXDATA21             :1;
            __IO  uint32_t  TXDATA22             :1;
            __IO  uint32_t  TXDATA23             :1;
            __IO  uint32_t  TXDATA24             :1;
            __IO  uint32_t  TXDATA25             :1;
            __IO  uint32_t  TXDATA26             :1;
            __IO  uint32_t  TXDATA27             :1;
            __IO  uint32_t  TXDATA28             :1;
            __IO  uint32_t  TXDATA29             :1;
            __IO  uint32_t  TXDATA30             :1;
            __IO  uint32_t  TXDATA31             :1;
        };
    };
} stc_hsspi_txfifo10_field_t;

typedef struct stc_hsspi_txfifo11_field
{
    union {
        struct {
            __IO  uint32_t  TXDATA               :32;
        };
        struct {
            __IO  uint32_t  TXDATA0              :1;
            __IO  uint32_t  TXDATA1              :1;
            __IO  uint32_t  TXDATA2              :1;
            __IO  uint32_t  TXDATA3              :1;
            __IO  uint32_t  TXDATA4              :1;
            __IO  uint32_t  TXDATA5              :1;
            __IO  uint32_t  TXDATA6              :1;
            __IO  uint32_t  TXDATA7              :1;
            __IO  uint32_t  TXDATA8              :1;
            __IO  uint32_t  TXDATA9              :1;
            __IO  uint32_t  TXDATA10             :1;
            __IO  uint32_t  TXDATA11             :1;
            __IO  uint32_t  TXDATA12             :1;
            __IO  uint32_t  TXDATA13             :1;
            __IO  uint32_t  TXDATA14             :1;
            __IO  uint32_t  TXDATA15             :1;
            __IO  uint32_t  TXDATA16             :1;
            __IO  uint32_t  TXDATA17             :1;
            __IO  uint32_t  TXDATA18             :1;
            __IO  uint32_t  TXDATA19             :1;
            __IO  uint32_t  TXDATA20             :1;
            __IO  uint32_t  TXDATA21             :1;
            __IO  uint32_t  TXDATA22             :1;
            __IO  uint32_t  TXDATA23             :1;
            __IO  uint32_t  TXDATA24             :1;
            __IO  uint32_t  TXDATA25             :1;
            __IO  uint32_t  TXDATA26             :1;
            __IO  uint32_t  TXDATA27             :1;
            __IO  uint32_t  TXDATA28             :1;
            __IO  uint32_t  TXDATA29             :1;
            __IO  uint32_t  TXDATA30             :1;
            __IO  uint32_t  TXDATA31             :1;
        };
    };
} stc_hsspi_txfifo11_field_t;

typedef struct stc_hsspi_txfifo12_field
{
    union {
        struct {
            __IO  uint32_t  TXDATA               :32;
        };
        struct {
            __IO  uint32_t  TXDATA0              :1;
            __IO  uint32_t  TXDATA1              :1;
            __IO  uint32_t  TXDATA2              :1;
            __IO  uint32_t  TXDATA3              :1;
            __IO  uint32_t  TXDATA4              :1;
            __IO  uint32_t  TXDATA5              :1;
            __IO  uint32_t  TXDATA6              :1;
            __IO  uint32_t  TXDATA7              :1;
            __IO  uint32_t  TXDATA8              :1;
            __IO  uint32_t  TXDATA9              :1;
            __IO  uint32_t  TXDATA10             :1;
            __IO  uint32_t  TXDATA11             :1;
            __IO  uint32_t  TXDATA12             :1;
            __IO  uint32_t  TXDATA13             :1;
            __IO  uint32_t  TXDATA14             :1;
            __IO  uint32_t  TXDATA15             :1;
            __IO  uint32_t  TXDATA16             :1;
            __IO  uint32_t  TXDATA17             :1;
            __IO  uint32_t  TXDATA18             :1;
            __IO  uint32_t  TXDATA19             :1;
            __IO  uint32_t  TXDATA20             :1;
            __IO  uint32_t  TXDATA21             :1;
            __IO  uint32_t  TXDATA22             :1;
            __IO  uint32_t  TXDATA23             :1;
            __IO  uint32_t  TXDATA24             :1;
            __IO  uint32_t  TXDATA25             :1;
            __IO  uint32_t  TXDATA26             :1;
            __IO  uint32_t  TXDATA27             :1;
            __IO  uint32_t  TXDATA28             :1;
            __IO  uint32_t  TXDATA29             :1;
            __IO  uint32_t  TXDATA30             :1;
            __IO  uint32_t  TXDATA31             :1;
        };
    };
} stc_hsspi_txfifo12_field_t;

typedef struct stc_hsspi_txfifo13_field
{
    union {
        struct {
            __IO  uint32_t  TXDATA               :32;
        };
        struct {
            __IO  uint32_t  TXDATA0              :1;
            __IO  uint32_t  TXDATA1              :1;
            __IO  uint32_t  TXDATA2              :1;
            __IO  uint32_t  TXDATA3              :1;
            __IO  uint32_t  TXDATA4              :1;
            __IO  uint32_t  TXDATA5              :1;
            __IO  uint32_t  TXDATA6              :1;
            __IO  uint32_t  TXDATA7              :1;
            __IO  uint32_t  TXDATA8              :1;
            __IO  uint32_t  TXDATA9              :1;
            __IO  uint32_t  TXDATA10             :1;
            __IO  uint32_t  TXDATA11             :1;
            __IO  uint32_t  TXDATA12             :1;
            __IO  uint32_t  TXDATA13             :1;
            __IO  uint32_t  TXDATA14             :1;
            __IO  uint32_t  TXDATA15             :1;
            __IO  uint32_t  TXDATA16             :1;
            __IO  uint32_t  TXDATA17             :1;
            __IO  uint32_t  TXDATA18             :1;
            __IO  uint32_t  TXDATA19             :1;
            __IO  uint32_t  TXDATA20             :1;
            __IO  uint32_t  TXDATA21             :1;
            __IO  uint32_t  TXDATA22             :1;
            __IO  uint32_t  TXDATA23             :1;
            __IO  uint32_t  TXDATA24             :1;
            __IO  uint32_t  TXDATA25             :1;
            __IO  uint32_t  TXDATA26             :1;
            __IO  uint32_t  TXDATA27             :1;
            __IO  uint32_t  TXDATA28             :1;
            __IO  uint32_t  TXDATA29             :1;
            __IO  uint32_t  TXDATA30             :1;
            __IO  uint32_t  TXDATA31             :1;
        };
    };
} stc_hsspi_txfifo13_field_t;

