mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xj/common/s6e2c4xj.h
#define FM4_BT15                                  ((FM_BT_TypeDef *)FM4_BT15_BASE)
#define FM_BT15                                   ((FM_BT_TypeDef *)FM4_BT15_BASE)
#define FM4_BT15_PPG                              ((FM_BT_PPG_TypeDef *)FM4_BT15_BASE)
#define FM_BT15_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT15_BASE)
#define FM4_BT15_PWC                              ((FM_BT_PWC_TypeDef *)FM4_BT15_BASE)
#define FM_BT15_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT15_BASE)
#define FM4_BT15_PWM                              ((FM_BT_PWM_TypeDef *)FM4_BT15_BASE)
#define FM_BT15_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT15_BASE)
#define FM4_BT15_RT                               ((FM_BT_RT_TypeDef *)FM4_BT15_BASE)
#define FM_BT15_RT                                ((FM_BT_RT_TypeDef *)FM4_BT15_BASE)
#define FM4_BT2                                   ((FM_BT_TypeDef *)FM4_BT2_BASE)
#define FM_BT2                                    ((FM_BT_TypeDef *)FM4_BT2_BASE)
#define FM4_BT2_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT2_BASE)
#define FM_BT2_PPG                                ((FM_BT_PPG_TypeDef *)FM4_BT2_BASE)
#define FM4_BT2_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT2_BASE)
#define FM_BT2_PWC                                ((FM_BT_PWC_TypeDef *)FM4_BT2_BASE)
#define FM4_BT2_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT2_BASE)
#define FM_BT2_PWM                                ((FM_BT_PWM_TypeDef *)FM4_BT2_BASE)
#define FM4_BT2_RT                                ((FM_BT_RT_TypeDef *)FM4_BT2_BASE)
#define FM_BT2_RT                                 ((FM_BT_RT_TypeDef *)FM4_BT2_BASE)
#define FM4_BT3                                   ((FM_BT_TypeDef *)FM4_BT3_BASE)
#define FM_BT3                                    ((FM_BT_TypeDef *)FM4_BT3_BASE)
#define FM4_BT3_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT3_BASE)
#define FM_BT3_PPG                                ((FM_BT_PPG_TypeDef *)FM4_BT3_BASE)
#define FM4_BT3_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT3_BASE)
#define FM_BT3_PWC                                ((FM_BT_PWC_TypeDef *)FM4_BT3_BASE)
#define FM4_BT3_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT3_BASE)
#define FM_BT3_PWM                                ((FM_BT_PWM_TypeDef *)FM4_BT3_BASE)
#define FM4_BT3_RT                                ((FM_BT_RT_TypeDef *)FM4_BT3_BASE)
#define FM_BT3_RT                                 ((FM_BT_RT_TypeDef *)FM4_BT3_BASE)
#define FM4_BT4                                   ((FM_BT_TypeDef *)FM4_BT4_BASE)
#define FM_BT4                                    ((FM_BT_TypeDef *)FM4_BT4_BASE)
#define FM4_BT4_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT4_BASE)
#define FM_BT4_PPG                                ((FM_BT_PPG_TypeDef *)FM4_BT4_BASE)
#define FM4_BT4_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT4_BASE)
#define FM_BT4_PWC                                ((FM_BT_PWC_TypeDef *)FM4_BT4_BASE)
#define FM4_BT4_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT4_BASE)
#define FM_BT4_PWM                                ((FM_BT_PWM_TypeDef *)FM4_BT4_BASE)
#define FM4_BT4_RT                                ((FM_BT_RT_TypeDef *)FM4_BT4_BASE)
#define FM_BT4_RT                                 ((FM_BT_RT_TypeDef *)FM4_BT4_BASE)
#define FM4_BT5                                   ((FM_BT_TypeDef *)FM4_BT5_BASE)
#define FM_BT5                                    ((FM_BT_TypeDef *)FM4_BT5_BASE)
#define FM4_BT5_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT5_BASE)
#define FM_BT5_PPG                                ((FM_BT_PPG_TypeDef *)FM4_BT5_BASE)
#define FM4_BT5_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT5_BASE)
#define FM_BT5_PWC                                ((FM_BT_PWC_TypeDef *)FM4_BT5_BASE)
#define FM4_BT5_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT5_BASE)
#define FM_BT5_PWM                                ((FM_BT_PWM_TypeDef *)FM4_BT5_BASE)
#define FM4_BT5_RT                                ((FM_BT_RT_TypeDef *)FM4_BT5_BASE)
#define FM_BT5_RT                                 ((FM_BT_RT_TypeDef *)FM4_BT5_BASE)
#define FM4_BT6                                   ((FM_BT_TypeDef *)FM4_BT6_BASE)
#define FM_BT6                                    ((FM_BT_TypeDef *)FM4_BT6_BASE)
#define FM4_BT6_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT6_BASE)
#define FM_BT6_PPG                                ((FM_BT_PPG_TypeDef *)FM4_BT6_BASE)
#define FM4_BT6_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT6_BASE)
#define FM_BT6_PWC                                ((FM_BT_PWC_TypeDef *)FM4_BT6_BASE)
#define FM4_BT6_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT6_BASE)
#define FM_BT6_PWM                                ((FM_BT_PWM_TypeDef *)FM4_BT6_BASE)
#define FM4_BT6_RT                                ((FM_BT_RT_TypeDef *)FM4_BT6_BASE)
#define FM_BT6_RT                                 ((FM_BT_RT_TypeDef *)FM4_BT6_BASE)
#define FM4_BT7                                   ((FM_BT_TypeDef *)FM4_BT7_BASE)
#define FM_BT7                                    ((FM_BT_TypeDef *)FM4_BT7_BASE)
#define FM4_BT7_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT7_BASE)
#define FM_BT7_PPG                                ((FM_BT_PPG_TypeDef *)FM4_BT7_BASE)
#define FM4_BT7_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT7_BASE)
#define FM_BT7_PWC                                ((FM_BT_PWC_TypeDef *)FM4_BT7_BASE)
#define FM4_BT7_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT7_BASE)
#define FM_BT7_PWM                                ((FM_BT_PWM_TypeDef *)FM4_BT7_BASE)
#define FM4_BT7_RT                                ((FM_BT_RT_TypeDef *)FM4_BT7_BASE)
#define FM_BT7_RT                                 ((FM_BT_RT_TypeDef *)FM4_BT7_BASE)
#define FM4_BT8                                   ((FM_BT_TypeDef *)FM4_BT8_BASE)
#define FM_BT8                                    ((FM_BT_TypeDef *)FM4_BT8_BASE)
#define FM4_BT8_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT8_BASE)
#define FM_BT8_PPG                                ((FM_BT_PPG_TypeDef *)FM4_BT8_BASE)
#define FM4_BT8_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT8_BASE)
#define FM_BT8_PWC                                ((FM_BT_PWC_TypeDef *)FM4_BT8_BASE)
#define FM4_BT8_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT8_BASE)
#define FM_BT8_PWM                                ((FM_BT_PWM_TypeDef *)FM4_BT8_BASE)
#define FM4_BT8_RT                                ((FM_BT_RT_TypeDef *)FM4_BT8_BASE)
#define FM_BT8_RT                                 ((FM_BT_RT_TypeDef *)FM4_BT8_BASE)
#define FM4_BT9                                   ((FM_BT_TypeDef *)FM4_BT9_BASE)
#define FM_BT9                                    ((FM_BT_TypeDef *)FM4_BT9_BASE)
#define FM4_BT9_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT9_BASE)
#define FM_BT9_PPG                                ((FM_BT_PPG_TypeDef *)FM4_BT9_BASE)
#define FM4_BT9_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT9_BASE)
#define FM_BT9_PWC                                ((FM_BT_PWC_TypeDef *)FM4_BT9_BASE)
#define FM4_BT9_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT9_BASE)
#define FM_BT9_PWM                                ((FM_BT_PWM_TypeDef *)FM4_BT9_BASE)
#define FM4_BT9_RT                                ((FM_BT_RT_TypeDef *)FM4_BT9_BASE)
#define FM_BT9_RT                                 ((FM_BT_RT_TypeDef *)FM4_BT9_BASE)
#define FM4_BTIOSEL03                             ((FM_BTIOSEL03_TypeDef *)FM4_BTIOSEL03_BASE)
#define FM_BTIOSEL03                              ((FM_BTIOSEL03_TypeDef *)FM4_BTIOSEL03_BASE)
#define FM4_BTIOSEL47                             ((FM_BTIOSEL47_TypeDef *)FM4_BTIOSEL47_BASE)
#define FM_BTIOSEL47                              ((FM_BTIOSEL47_TypeDef *)FM4_BTIOSEL47_BASE)
#define FM4_BTIOSEL8B                             ((FM_BTIOSEL8B_TypeDef *)FM4_BTIOSEL8B_BASE)
#define FM_BTIOSEL8B                              ((FM_BTIOSEL8B_TypeDef *)FM4_BTIOSEL8B_BASE)
#define FM4_BTIOSELCF                             ((FM_BTIOSELCF_TypeDef *)FM4_BTIOSELCF_BASE)
#define FM_BTIOSELCF                              ((FM_BTIOSELCF_TypeDef *)FM4_BTIOSELCF_BASE)
#define FM4_CAN0                                  ((FM_CAN_TypeDef *)FM4_CAN0_BASE)
#define FM_CAN0                                   ((FM_CAN_TypeDef *)FM4_CAN0_BASE)
#define FM4_CAN1                                  ((FM_CAN_TypeDef *)FM4_CAN1_BASE)
#define FM_CAN1                                   ((FM_CAN_TypeDef *)FM4_CAN1_BASE)
#define FM4_CANFD0                                ((FM_CANFD_TypeDef *)FM4_CANFD0_BASE)
#define FM_CANFD0                                 ((FM_CANFD_TypeDef *)FM4_CANFD0_BASE)
#define FM4_CANPRES                               ((FM_CANPRES_TypeDef *)FM4_CANPRES_BASE)
#define FM_CANPRES                                ((FM_CANPRES_TypeDef *)FM4_CANPRES_BASE)
#define FM4_CLK_GATING                            ((FM_CLK_GATING_TypeDef *)FM4_CLK_GATING_BASE)
#define FM_CLK_GATING                             ((FM_CLK_GATING_TypeDef *)FM4_CLK_GATING_BASE)
#define FM4_CRC                                   ((FM_CRC_TypeDef *)FM4_CRC_BASE)
#define FM_CRC                                    ((FM_CRC_TypeDef *)FM4_CRC_BASE)
#define FM4_CRG                                   ((FM_CRG_TypeDef *)FM4_CRG_BASE)
#define FM_CRG                                    ((FM_CRG_TypeDef *)FM4_CRG_BASE)
#define FM4_CRTRIM                                ((FM_CRTRIM_TypeDef *)FM4_CRTRIM_BASE)
#define FM_CRTRIM                                 ((FM_CRTRIM_TypeDef *)FM4_CRTRIM_BASE)
#define FM4_DAC0                                  ((FM_DAC_TypeDef *)FM4_DAC0_BASE)
#define FM_DAC0                                   ((FM_DAC_TypeDef *)FM4_DAC0_BASE)
#define FM4_DAC1                                  ((FM_DAC_TypeDef *)FM4_DAC1_BASE)
#define FM_DAC1                                   ((FM_DAC_TypeDef *)FM4_DAC1_BASE)
#define FM4_DMAC                                  ((FM_DMAC_TypeDef *)FM4_DMAC_BASE)
#define FM_DMAC                                   ((FM_DMAC_TypeDef *)FM4_DMAC_BASE)
#define FM4_DS                                    ((FM_DS_TypeDef *)FM4_DS_BASE)
#define FM_DS                                     ((FM_DS_TypeDef *)FM4_DS_BASE)
#define FM4_DSTC                                  ((FM_DSTC_TypeDef *)FM4_DSTC_BASE)
#define FM_DSTC                                   ((FM_DSTC_TypeDef *)FM4_DSTC_BASE)
#define FM4_DT                                    ((FM_DT_TypeDef *)FM4_DT_BASE)
#define FM_DT                                     ((FM_DT_TypeDef *)FM4_DT_BASE)
#define FM4_DUALFLASH_IF                          ((FM_DUALFLASH_IF_TypeDef *)FM4_DUALFLASH_IF_BASE)
#define FM_DUALFLASH_IF                           ((FM_DUALFLASH_IF_TypeDef *)FM4_DUALFLASH_IF_BASE)
#define FM4_ECC_CAPTURE                           ((FM_ECC_CAPTURE_TypeDef *)FM4_ECC_CAPTURE_BASE)
#define FM_ECC_CAPTURE                            ((FM_ECC_CAPTURE_TypeDef *)FM4_ECC_CAPTURE_BASE)
#define FM4_EXBUS                                 ((FM_EXBUS_TypeDef *)FM4_EXBUS_BASE)
#define FM_EXBUS                                  ((FM_EXBUS_TypeDef *)FM4_EXBUS_BASE)
#define FM4_EXTI                                  ((FM_EXTI_TypeDef *)FM4_EXTI_BASE)
#define FM_EXTI                                   ((FM_EXTI_TypeDef *)FM4_EXTI_BASE)
#define FM4_FLASH_IF                              ((FM_FLASH_IF_TypeDef *)FM4_FLASH_IF_BASE)
#define FM_FLASH_IF                               ((FM_FLASH_IF_TypeDef *)FM4_FLASH_IF_BASE)
#define FM4_GPIO                                  ((FM_GPIO_TypeDef *)FM4_GPIO_BASE)
#define FM_GPIO                                   ((FM_GPIO_TypeDef *)FM4_GPIO_BASE)
#define FM4_HSSPI                                 ((FM_HSSPI_TypeDef *)FM4_HSSPI_BASE)
#define FM_HSSPI                                  ((FM_HSSPI_TypeDef *)FM4_HSSPI_BASE)
#define FM4_HWWDT                                 ((FM_HWWDT_TypeDef *)FM4_HWWDT_BASE)
#define FM_HWWDT                                  ((FM_HWWDT_TypeDef *)FM4_HWWDT_BASE)
#define FM4_I2S0                                  ((FM_I2S_TypeDef *)FM4_I2S0_BASE)
#define FM_I2S0                                   ((FM_I2S_TypeDef *)FM4_I2S0_BASE)
#define FM4_I2SPRE                                ((FM_I2SPRE_TypeDef *)FM4_I2SPRE_BASE)
#define FM_I2SPRE                                 ((FM_I2SPRE_TypeDef *)FM4_I2SPRE_BASE)
#define FM4_INTREQ                                ((FM_INTREQ_TypeDef *)FM4_INTREQ_BASE)
#define FM_INTREQ                                 ((FM_INTREQ_TypeDef *)FM4_INTREQ_BASE)
#define FM4_LSCRP                                 ((FM_LSCRP_TypeDef *)FM4_LSCRP_BASE)
#define FM_LSCRP                                  ((FM_LSCRP_TypeDef *)FM4_LSCRP_BASE)
#define FM4_LVD                                   ((FM_LVD_TypeDef *)FM4_LVD_BASE)
#define FM_LVD                                    ((FM_LVD_TypeDef *)FM4_LVD_BASE)
#define FM4_MFS0                                  ((FM_MFS_TypeDef *)FM4_MFS0_BASE)
#define FM_MFS0                                   ((FM_MFS_TypeDef *)FM4_MFS0_BASE)
#define FM4_MFS0_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM4_MFS0_BASE)
#define FM_MFS0_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM4_MFS0_BASE)
#define FM4_MFS0_I2C                              ((FM_MFS_I2C_TypeDef *)FM4_MFS0_BASE)
#define FM_MFS0_I2C                               ((FM_MFS_I2C_TypeDef *)FM4_MFS0_BASE)
#define FM4_MFS0_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS0_BASE)
#define FM_MFS0_LIN                               ((FM_MFS_LIN_TypeDef *)FM4_MFS0_BASE)
#define FM4_MFS0_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS0_BASE)
#define FM_MFS0_UART                              ((FM_MFS_UART_TypeDef *)FM4_MFS0_BASE)
#define FM4_MFS1                                  ((FM_MFS_TypeDef *)FM4_MFS1_BASE)
#define FM_MFS1                                   ((FM_MFS_TypeDef *)FM4_MFS1_BASE)
#define FM4_MFS1_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM4_MFS1_BASE)
#define FM_MFS1_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM4_MFS1_BASE)
#define FM4_MFS1_I2C                              ((FM_MFS_I2C_TypeDef *)FM4_MFS1_BASE)
#define FM_MFS1_I2C                               ((FM_MFS_I2C_TypeDef *)FM4_MFS1_BASE)
#define FM4_MFS1_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS1_BASE)
#define FM_MFS1_LIN                               ((FM_MFS_LIN_TypeDef *)FM4_MFS1_BASE)
#define FM4_MFS1_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS1_BASE)
#define FM_MFS1_UART                              ((FM_MFS_UART_TypeDef *)FM4_MFS1_BASE)
#define FM4_MFS10                                 ((FM_MFS_TypeDef *)FM4_MFS10_BASE)
#define FM_MFS10                                  ((FM_MFS_TypeDef *)FM4_MFS10_BASE)
#define FM4_MFS10_CSIO                            ((FM_MFS_CSIO_TypeDef *)FM4_MFS10_BASE)
#define FM_MFS10_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM4_MFS10_BASE)
#define FM4_MFS10_I2C                             ((FM_MFS_I2C_TypeDef *)FM4_MFS10_BASE)
#define FM_MFS10_I2C                              ((FM_MFS_I2C_TypeDef *)FM4_MFS10_BASE)
#define FM4_MFS10_LIN                             ((FM_MFS_LIN_TypeDef *)FM4_MFS10_BASE)
#define FM_MFS10_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS10_BASE)
#define FM4_MFS10_UART                            ((FM_MFS_UART_TypeDef *)FM4_MFS10_BASE)
#define FM_MFS10_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS10_BASE)
#define FM4_MFS11                                 ((FM_MFS_TypeDef *)FM4_MFS11_BASE)
#define FM_MFS11                                  ((FM_MFS_TypeDef *)FM4_MFS11_BASE)
#define FM4_MFS11_CSIO                            ((FM_MFS_CSIO_TypeDef *)FM4_MFS11_BASE)
#define FM_MFS11_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM4_MFS11_BASE)
#define FM4_MFS11_I2C                             ((FM_MFS_I2C_TypeDef *)FM4_MFS11_BASE)
#define FM_MFS11_I2C                              ((FM_MFS_I2C_TypeDef *)FM4_MFS11_BASE)
#define FM4_MFS11_LIN                             ((FM_MFS_LIN_TypeDef *)FM4_MFS11_BASE)
#define FM_MFS11_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS11_BASE)
#define FM4_MFS11_UART                            ((FM_MFS_UART_TypeDef *)FM4_MFS11_BASE)
#define FM_MFS11_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS11_BASE)
#define FM4_MFS12                                 ((FM_MFS_TypeDef *)FM4_MFS12_BASE)
#define FM_MFS12                                  ((FM_MFS_TypeDef *)FM4_MFS12_BASE)
#define FM4_MFS12_CSIO                            ((FM_MFS_CSIO_TypeDef *)FM4_MFS12_BASE)
#define FM_MFS12_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM4_MFS12_BASE)
#define FM4_MFS12_I2C                             ((FM_MFS_I2C_TypeDef *)FM4_MFS12_BASE)
#define FM_MFS12_I2C                              ((FM_MFS_I2C_TypeDef *)FM4_MFS12_BASE)
#define FM4_MFS12_LIN                             ((FM_MFS_LIN_TypeDef *)FM4_MFS12_BASE)
#define FM_MFS12_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS12_BASE)
#define FM4_MFS12_UART                            ((FM_MFS_UART_TypeDef *)FM4_MFS12_BASE)
#define FM_MFS12_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS12_BASE)
#define FM4_MFS13                                 ((FM_MFS_TypeDef *)FM4_MFS13_BASE)
#define FM_MFS13                                  ((FM_MFS_TypeDef *)FM4_MFS13_BASE)
#define FM4_MFS13_CSIO                            ((FM_MFS_CSIO_TypeDef *)FM4_MFS13_BASE)
#define FM_MFS13_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM4_MFS13_BASE)
#define FM4_MFS13_I2C                             ((FM_MFS_I2C_TypeDef *)FM4_MFS13_BASE)
#define FM_MFS13_I2C                              ((FM_MFS_I2C_TypeDef *)FM4_MFS13_BASE)
#define FM4_MFS13_LIN                             ((FM_MFS_LIN_TypeDef *)FM4_MFS13_BASE)
#define FM_MFS13_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS13_BASE)
#define FM4_MFS13_UART                            ((FM_MFS_UART_TypeDef *)FM4_MFS13_BASE)
#define FM_MFS13_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS13_BASE)
#define FM4_MFS14                                 ((FM_MFS_TypeDef *)FM4_MFS14_BASE)
#define FM_MFS14                                  ((FM_MFS_TypeDef *)FM4_MFS14_BASE)
#define FM4_MFS14_CSIO                            ((FM_MFS_CSIO_TypeDef *)FM4_MFS14_BASE)
#define FM_MFS14_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM4_MFS14_BASE)
#define FM4_MFS14_I2C                             ((FM_MFS_I2C_TypeDef *)FM4_MFS14_BASE)
#define FM_MFS14_I2C                              ((FM_MFS_I2C_TypeDef *)FM4_MFS14_BASE)
#define FM4_MFS14_LIN                             ((FM_MFS_LIN_TypeDef *)FM4_MFS14_BASE)
#define FM_MFS14_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS14_BASE)
#define FM4_MFS14_UART                            ((FM_MFS_UART_TypeDef *)FM4_MFS14_BASE)
#define FM_MFS14_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS14_BASE)
#define FM4_MFS15                                 ((FM_MFS_TypeDef *)FM4_MFS15_BASE)
#define FM_MFS15                                  ((FM_MFS_TypeDef *)FM4_MFS15_BASE)
#define FM4_MFS15_CSIO                            ((FM_MFS_CSIO_TypeDef *)FM4_MFS15_BASE)
#define FM_MFS15_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM4_MFS15_BASE)
#define FM4_MFS15_I2C                             ((FM_MFS_I2C_TypeDef *)FM4_MFS15_BASE)
#define FM_MFS15_I2C                              ((FM_MFS_I2C_TypeDef *)FM4_MFS15_BASE)
#define FM4_MFS15_LIN                             ((FM_MFS_LIN_TypeDef *)FM4_MFS15_BASE)
#define FM_MFS15_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS15_BASE)
#define FM4_MFS15_UART                            ((FM_MFS_UART_TypeDef *)FM4_MFS15_BASE)
#define FM_MFS15_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS15_BASE)
#define FM4_MFS2                                  ((FM_MFS_TypeDef *)FM4_MFS2_BASE)
#define FM_MFS2                                   ((FM_MFS_TypeDef *)FM4_MFS2_BASE)
#define FM4_MFS2_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM4_MFS2_BASE)
#define FM_MFS2_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM4_MFS2_BASE)
#define FM4_MFS2_I2C                              ((FM_MFS_I2C_TypeDef *)FM4_MFS2_BASE)
#define FM_MFS2_I2C                               ((FM_MFS_I2C_TypeDef *)FM4_MFS2_BASE)
#define FM4_MFS2_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS2_BASE)
#define FM_MFS2_LIN                               ((FM_MFS_LIN_TypeDef *)FM4_MFS2_BASE)
#define FM4_MFS2_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS2_BASE)
#define FM_MFS2_UART                              ((FM_MFS_UART_TypeDef *)FM4_MFS2_BASE)
#define FM4_MFS3                                  ((FM_MFS_TypeDef *)FM4_MFS3_BASE)
#define FM_MFS3                                   ((FM_MFS_TypeDef *)FM4_MFS3_BASE)
#define FM4_MFS3_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM4_MFS3_BASE)
#define FM_MFS3_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM4_MFS3_BASE)
#define FM4_MFS3_I2C                              ((FM_MFS_I2C_TypeDef *)FM4_MFS3_BASE)
#define FM_MFS3_I2C                               ((FM_MFS_I2C_TypeDef *)FM4_MFS3_BASE)
#define FM4_MFS3_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS3_BASE)
#define FM_MFS3_LIN                               ((FM_MFS_LIN_TypeDef *)FM4_MFS3_BASE)
#define FM4_MFS3_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS3_BASE)
#define FM_MFS3_UART                              ((FM_MFS_UART_TypeDef *)FM4_MFS3_BASE)
#define FM4_MFS4                                  ((FM_MFS_TypeDef *)FM4_MFS4_BASE)
#define FM_MFS4                                   ((FM_MFS_TypeDef *)FM4_MFS4_BASE)
#define FM4_MFS4_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM4_MFS4_BASE)
#define FM_MFS4_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM4_MFS4_BASE)
#define FM4_MFS4_I2C                              ((FM_MFS_I2C_TypeDef *)FM4_MFS4_BASE)
#define FM_MFS4_I2C                               ((FM_MFS_I2C_TypeDef *)FM4_MFS4_BASE)
#define FM4_MFS4_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS4_BASE)
#define FM_MFS4_LIN                               ((FM_MFS_LIN_TypeDef *)FM4_MFS4_BASE)
#define FM4_MFS4_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS4_BASE)
#define FM_MFS4_UART                              ((FM_MFS_UART_TypeDef *)FM4_MFS4_BASE)
#define FM4_MFS5                                  ((FM_MFS_TypeDef *)FM4_MFS5_BASE)
#define FM_MFS5                                   ((FM_MFS_TypeDef *)FM4_MFS5_BASE)
#define FM4_MFS5_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM4_MFS5_BASE)
#define FM_MFS5_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM4_MFS5_BASE)
#define FM4_MFS5_I2C                              ((FM_MFS_I2C_TypeDef *)FM4_MFS5_BASE)
#define FM_MFS5_I2C                               ((FM_MFS_I2C_TypeDef *)FM4_MFS5_BASE)
#define FM4_MFS5_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS5_BASE)
#define FM_MFS5_LIN                               ((FM_MFS_LIN_TypeDef *)FM4_MFS5_BASE)
#define FM4_MFS5_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS5_BASE)
#define FM_MFS5_UART                              ((FM_MFS_UART_TypeDef *)FM4_MFS5_BASE)
