mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xj/common/s6e2c4xj.h
#define FM_GPIO_EPFR01_AVAILABLE                  1
#define FM4_GPIO_EPFR02_AVAILABLE                 1
#define FM_GPIO_EPFR02_AVAILABLE                  1
#define FM4_GPIO_EPFR03_AVAILABLE                 1
#define FM_GPIO_EPFR03_AVAILABLE                  1
#define FM4_GPIO_EPFR04_AVAILABLE                 1
#define FM_GPIO_EPFR04_AVAILABLE                  1
#define FM4_GPIO_EPFR05_AVAILABLE                 1
#define FM_GPIO_EPFR05_AVAILABLE                  1
#define FM4_GPIO_EPFR06_AVAILABLE                 1
#define FM_GPIO_EPFR06_AVAILABLE                  1
#define FM4_GPIO_EPFR07_AVAILABLE                 1
#define FM_GPIO_EPFR07_AVAILABLE                  1
#define FM4_GPIO_EPFR08_AVAILABLE                 1
#define FM_GPIO_EPFR08_AVAILABLE                  1
#define FM4_GPIO_EPFR09_AVAILABLE                 1
#define FM_GPIO_EPFR09_AVAILABLE                  1
#define FM4_GPIO_EPFR10_AVAILABLE                 1
#define FM_GPIO_EPFR10_AVAILABLE                  1
#define FM4_GPIO_EPFR11_AVAILABLE                 1
#define FM_GPIO_EPFR11_AVAILABLE                  1
#define FM4_GPIO_EPFR12_AVAILABLE                 1
#define FM_GPIO_EPFR12_AVAILABLE                  1
#define FM4_GPIO_EPFR13_AVAILABLE                 1
#define FM_GPIO_EPFR13_AVAILABLE                  1
#define FM4_GPIO_EPFR14_AVAILABLE                 1
#define FM_GPIO_EPFR14_AVAILABLE                  1
#define FM4_GPIO_EPFR15_AVAILABLE                 1
#define FM_GPIO_EPFR15_AVAILABLE                  1
#define FM4_GPIO_EPFR16_AVAILABLE                 1
#define FM_GPIO_EPFR16_AVAILABLE                  1
#define FM4_GPIO_EPFR17_AVAILABLE                 1
#define FM_GPIO_EPFR17_AVAILABLE                  1
#define FM4_GPIO_EPFR18_AVAILABLE                 1
#define FM_GPIO_EPFR18_AVAILABLE                  1
#define FM4_GPIO_EPFR19_AVAILABLE                 1
#define FM_GPIO_EPFR19_AVAILABLE                  1
#define FM4_GPIO_EPFR20_AVAILABLE                 1
#define FM_GPIO_EPFR20_AVAILABLE                  1
#define FM4_GPIO_EPFR21_AVAILABLE                 1
#define FM_GPIO_EPFR21_AVAILABLE                  1
#define FM4_GPIO_EPFR22_AVAILABLE                 1
#define FM_GPIO_EPFR22_AVAILABLE                  1
#define FM4_GPIO_EPFR23_AVAILABLE                 1
#define FM_GPIO_EPFR23_AVAILABLE                  1
#define FM4_GPIO_EPFR24_AVAILABLE                 1
#define FM_GPIO_EPFR24_AVAILABLE                  1
#define FM4_GPIO_EPFR25_AVAILABLE                 1
#define FM_GPIO_EPFR25_AVAILABLE                  1
#define FM4_GPIO_EPFR26_AVAILABLE                 1
#define FM_GPIO_EPFR26_AVAILABLE                  1
#define FM4_GPIO_PCR0_AVAILABLE                   1
#define FM_GPIO_PCR0_AVAILABLE                    1
#define FM4_GPIO_PCR1_AVAILABLE                   1
#define FM_GPIO_PCR1_AVAILABLE                    1
#define FM4_GPIO_PCR2_AVAILABLE                   1
#define FM_GPIO_PCR2_AVAILABLE                    1
#define FM4_GPIO_PCR3_AVAILABLE                   1
#define FM_GPIO_PCR3_AVAILABLE                    1
#define FM4_GPIO_PCR4_AVAILABLE                   1
#define FM_GPIO_PCR4_AVAILABLE                    1
#define FM4_GPIO_PCR5_AVAILABLE                   1
#define FM_GPIO_PCR5_AVAILABLE                    1
#define FM4_GPIO_PCR6_AVAILABLE                   1
#define FM_GPIO_PCR6_AVAILABLE                    1
#define FM4_GPIO_PCR7_AVAILABLE                   1
#define FM_GPIO_PCR7_AVAILABLE                    1
#define FM4_GPIO_PCR9_AVAILABLE                   1
#define FM_GPIO_PCR9_AVAILABLE                    1
#define FM4_GPIO_PCRA_AVAILABLE                   1
#define FM_GPIO_PCRA_AVAILABLE                    1
#define FM4_GPIO_PCRB_AVAILABLE                   1
#define FM_GPIO_PCRB_AVAILABLE                    1
#define FM4_GPIO_PCRC_AVAILABLE                   1
#define FM_GPIO_PCRC_AVAILABLE                    1
#define FM4_GPIO_PCRD_AVAILABLE                   1
#define FM_GPIO_PCRD_AVAILABLE                    1
#define FM4_GPIO_PCRE_AVAILABLE                   1
#define FM_GPIO_PCRE_AVAILABLE                    1
#define FM4_GPIO_PCRF_AVAILABLE                   1
#define FM_GPIO_PCRF_AVAILABLE                    1
#define FM4_GPIO_PDIR0_AVAILABLE                  1
#define FM_GPIO_PDIR0_AVAILABLE                   1
#define FM4_GPIO_PDIR1_AVAILABLE                  1
#define FM_GPIO_PDIR1_AVAILABLE                   1
#define FM4_GPIO_PDIR2_AVAILABLE                  1
#define FM_GPIO_PDIR2_AVAILABLE                   1
#define FM4_GPIO_PDIR3_AVAILABLE                  1
#define FM_GPIO_PDIR3_AVAILABLE                   1
#define FM4_GPIO_PDIR4_AVAILABLE                  1
#define FM_GPIO_PDIR4_AVAILABLE                   1
#define FM4_GPIO_PDIR5_AVAILABLE                  1
#define FM_GPIO_PDIR5_AVAILABLE                   1
#define FM4_GPIO_PDIR6_AVAILABLE                  1
#define FM_GPIO_PDIR6_AVAILABLE                   1
#define FM4_GPIO_PDIR7_AVAILABLE                  1
#define FM_GPIO_PDIR7_AVAILABLE                   1
#define FM4_GPIO_PDIR8_AVAILABLE                  1
#define FM_GPIO_PDIR8_AVAILABLE                   1
#define FM4_GPIO_PDIR9_AVAILABLE                  1
#define FM_GPIO_PDIR9_AVAILABLE                   1
#define FM4_GPIO_PDIRA_AVAILABLE                  1
#define FM_GPIO_PDIRA_AVAILABLE                   1
#define FM4_GPIO_PDIRB_AVAILABLE                  1
#define FM_GPIO_PDIRB_AVAILABLE                   1
#define FM4_GPIO_PDIRC_AVAILABLE                  1
#define FM_GPIO_PDIRC_AVAILABLE                   1
#define FM4_GPIO_PDIRD_AVAILABLE                  1
#define FM_GPIO_PDIRD_AVAILABLE                   1
#define FM4_GPIO_PDIRE_AVAILABLE                  1
#define FM_GPIO_PDIRE_AVAILABLE                   1
#define FM4_GPIO_PDIRF_AVAILABLE                  1
#define FM_GPIO_PDIRF_AVAILABLE                   1
#define FM4_GPIO_PDOR0_AVAILABLE                  1
#define FM_GPIO_PDOR0_AVAILABLE                   1
#define FM4_GPIO_PDOR1_AVAILABLE                  1
#define FM_GPIO_PDOR1_AVAILABLE                   1
#define FM4_GPIO_PDOR2_AVAILABLE                  1
#define FM_GPIO_PDOR2_AVAILABLE                   1
#define FM4_GPIO_PDOR3_AVAILABLE                  1
#define FM_GPIO_PDOR3_AVAILABLE                   1
#define FM4_GPIO_PDOR4_AVAILABLE                  1
#define FM_GPIO_PDOR4_AVAILABLE                   1
#define FM4_GPIO_PDOR5_AVAILABLE                  1
#define FM_GPIO_PDOR5_AVAILABLE                   1
#define FM4_GPIO_PDOR6_AVAILABLE                  1
#define FM_GPIO_PDOR6_AVAILABLE                   1
#define FM4_GPIO_PDOR7_AVAILABLE                  1
#define FM_GPIO_PDOR7_AVAILABLE                   1
#define FM4_GPIO_PDOR8_AVAILABLE                  1
#define FM_GPIO_PDOR8_AVAILABLE                   1
#define FM4_GPIO_PDOR9_AVAILABLE                  1
#define FM_GPIO_PDOR9_AVAILABLE                   1
#define FM4_GPIO_PDORA_AVAILABLE                  1
#define FM_GPIO_PDORA_AVAILABLE                   1
#define FM4_GPIO_PDORB_AVAILABLE                  1
#define FM_GPIO_PDORB_AVAILABLE                   1
#define FM4_GPIO_PDORC_AVAILABLE                  1
#define FM_GPIO_PDORC_AVAILABLE                   1
#define FM4_GPIO_PDORD_AVAILABLE                  1
#define FM_GPIO_PDORD_AVAILABLE                   1
#define FM4_GPIO_PDORE_AVAILABLE                  1
#define FM_GPIO_PDORE_AVAILABLE                   1
#define FM4_GPIO_PDORF_AVAILABLE                  1
#define FM_GPIO_PDORF_AVAILABLE                   1
#define FM4_GPIO_PDSR0_AVAILABLE                  1
#define FM_GPIO_PDSR0_AVAILABLE                   1
#define FM4_GPIO_PDSR1_AVAILABLE                  1
#define FM_GPIO_PDSR1_AVAILABLE                   1
#define FM4_GPIO_PDSR2_AVAILABLE                  1
#define FM_GPIO_PDSR2_AVAILABLE                   1
#define FM4_GPIO_PDSR3_AVAILABLE                  1
#define FM_GPIO_PDSR3_AVAILABLE                   1
#define FM4_GPIO_PDSR4_AVAILABLE                  1
#define FM_GPIO_PDSR4_AVAILABLE                   1
#define FM4_GPIO_PDSR5_AVAILABLE                  1
#define FM_GPIO_PDSR5_AVAILABLE                   1
#define FM4_GPIO_PDSR6_AVAILABLE                  1
#define FM_GPIO_PDSR6_AVAILABLE                   1
#define FM4_GPIO_PDSR7_AVAILABLE                  1
#define FM_GPIO_PDSR7_AVAILABLE                   1
#define FM4_GPIO_PDSR8_AVAILABLE                  1
#define FM_GPIO_PDSR8_AVAILABLE                   1
#define FM4_GPIO_PDSR9_AVAILABLE                  1
#define FM_GPIO_PDSR9_AVAILABLE                   1
#define FM4_GPIO_PDSRA_AVAILABLE                  1
#define FM_GPIO_PDSRA_AVAILABLE                   1
#define FM4_GPIO_PDSRB_AVAILABLE                  1
#define FM_GPIO_PDSRB_AVAILABLE                   1
#define FM4_GPIO_PDSRC_AVAILABLE                  1
#define FM_GPIO_PDSRC_AVAILABLE                   1
#define FM4_GPIO_PDSRD_AVAILABLE                  1
#define FM_GPIO_PDSRD_AVAILABLE                   1
#define FM4_GPIO_PDSRE_AVAILABLE                  1
#define FM_GPIO_PDSRE_AVAILABLE                   1
#define FM4_GPIO_PDSRF_AVAILABLE                  1
#define FM_GPIO_PDSRF_AVAILABLE                   1
#define FM4_GPIO_PFR0_AVAILABLE                   1
#define FM_GPIO_PFR0_AVAILABLE                    1
#define FM4_GPIO_PFR1_AVAILABLE                   1
#define FM_GPIO_PFR1_AVAILABLE                    1
#define FM4_GPIO_PFR2_AVAILABLE                   1
#define FM_GPIO_PFR2_AVAILABLE                    1
#define FM4_GPIO_PFR3_AVAILABLE                   1
#define FM_GPIO_PFR3_AVAILABLE                    1
#define FM4_GPIO_PFR4_AVAILABLE                   1
#define FM_GPIO_PFR4_AVAILABLE                    1
#define FM4_GPIO_PFR5_AVAILABLE                   1
#define FM_GPIO_PFR5_AVAILABLE                    1
#define FM4_GPIO_PFR6_AVAILABLE                   1
#define FM_GPIO_PFR6_AVAILABLE                    1
#define FM4_GPIO_PFR7_AVAILABLE                   1
#define FM_GPIO_PFR7_AVAILABLE                    1
#define FM4_GPIO_PFR8_AVAILABLE                   1
#define FM_GPIO_PFR8_AVAILABLE                    1
#define FM4_GPIO_PFR9_AVAILABLE                   1
#define FM_GPIO_PFR9_AVAILABLE                    1
#define FM4_GPIO_PFRA_AVAILABLE                   1
#define FM_GPIO_PFRA_AVAILABLE                    1
#define FM4_GPIO_PFRB_AVAILABLE                   1
#define FM_GPIO_PFRB_AVAILABLE                    1
#define FM4_GPIO_PFRC_AVAILABLE                   1
#define FM_GPIO_PFRC_AVAILABLE                    1
#define FM4_GPIO_PFRD_AVAILABLE                   1
#define FM_GPIO_PFRD_AVAILABLE                    1
#define FM4_GPIO_PFRE_AVAILABLE                   1
#define FM_GPIO_PFRE_AVAILABLE                    1
#define FM4_GPIO_PFRF_AVAILABLE                   1
#define FM_GPIO_PFRF_AVAILABLE                    1
#define FM4_GPIO_PZR0_AVAILABLE                   1
#define FM_GPIO_PZR0_AVAILABLE                    1
#define FM4_GPIO_PZR1_AVAILABLE                   1
#define FM_GPIO_PZR1_AVAILABLE                    1
#define FM4_GPIO_PZR2_AVAILABLE                   1
#define FM_GPIO_PZR2_AVAILABLE                    1
#define FM4_GPIO_PZR3_AVAILABLE                   1
#define FM_GPIO_PZR3_AVAILABLE                    1
#define FM4_GPIO_PZR4_AVAILABLE                   1
#define FM_GPIO_PZR4_AVAILABLE                    1
#define FM4_GPIO_PZR5_AVAILABLE                   1
#define FM_GPIO_PZR5_AVAILABLE                    1
#define FM4_GPIO_PZR6_AVAILABLE                   1
#define FM_GPIO_PZR6_AVAILABLE                    1
#define FM4_GPIO_PZR7_AVAILABLE                   1
#define FM_GPIO_PZR7_AVAILABLE                    1
#define FM4_GPIO_PZR8_AVAILABLE                   1
#define FM_GPIO_PZR8_AVAILABLE                    1
#define FM4_GPIO_PZR9_AVAILABLE                   1
#define FM_GPIO_PZR9_AVAILABLE                    1
#define FM4_GPIO_PZRA_AVAILABLE                   1
#define FM_GPIO_PZRA_AVAILABLE                    1
#define FM4_GPIO_PZRB_AVAILABLE                   1
#define FM_GPIO_PZRB_AVAILABLE                    1
#define FM4_GPIO_PZRC_AVAILABLE                   1
#define FM_GPIO_PZRC_AVAILABLE                    1
#define FM4_GPIO_PZRD_AVAILABLE                   1
#define FM_GPIO_PZRD_AVAILABLE                    1
#define FM4_GPIO_PZRE_AVAILABLE                   1
#define FM_GPIO_PZRE_AVAILABLE                    1
#define FM4_GPIO_PZRF_AVAILABLE                   1
#define FM_GPIO_PZRF_AVAILABLE                    1
#define FM4_GPIO_SPSR_AVAILABLE                   1
#define FM_GPIO_SPSR_AVAILABLE                    1
/*******************************************************************************
* HSSPI
*******************************************************************************/
#define FM4_HSSPI_CSAEXT_AVAILABLE                1
#define FM_HSSPI_CSAEXT_AVAILABLE                 1
#define FM4_HSSPI_CSCFG_AVAILABLE                 1
#define FM_HSSPI_CSCFG_AVAILABLE                  1
#define FM4_HSSPI_CSITIME_AVAILABLE               1
#define FM_HSSPI_CSITIME_AVAILABLE                1
#define FM4_HSSPI_DBCNT_AVAILABLE                 1
#define FM_HSSPI_DBCNT_AVAILABLE                  1
#define FM4_HSSPI_DMBCC_AVAILABLE                 1
#define FM_HSSPI_DMBCC_AVAILABLE                  1
#define FM4_HSSPI_DMBCS_AVAILABLE                 1
#define FM_HSSPI_DMBCS_AVAILABLE                  1
#define FM4_HSSPI_DMCFG_AVAILABLE                 1
#define FM_HSSPI_DMCFG_AVAILABLE                  1
#define FM4_HSSPI_DMDMAEN_AVAILABLE               1
#define FM_HSSPI_DMDMAEN_AVAILABLE                1
#define FM4_HSSPI_DMPSEL_AVAILABLE                1
#define FM_HSSPI_DMPSEL_AVAILABLE                 1
#define FM4_HSSPI_DMSTART_AVAILABLE               1
#define FM_HSSPI_DMSTART_AVAILABLE                1
#define FM4_HSSPI_DMSTATUS_AVAILABLE              1
#define FM_HSSPI_DMSTATUS_AVAILABLE               1
#define FM4_HSSPI_DMSTOP_AVAILABLE                1
#define FM_HSSPI_DMSTOP_AVAILABLE                 1
#define FM4_HSSPI_DMTRP_AVAILABLE                 1
#define FM_HSSPI_DMTRP_AVAILABLE                  1
#define FM4_HSSPI_FAULTC_AVAILABLE                1
#define FM_HSSPI_FAULTC_AVAILABLE                 1
#define FM4_HSSPI_FAULTF_AVAILABLE                1
#define FM_HSSPI_FAULTF_AVAILABLE                 1
#define FM4_HSSPI_FIFOCFG_AVAILABLE               1
#define FM_HSSPI_FIFOCFG_AVAILABLE                1
#define FM4_HSSPI_MCTRL_AVAILABLE                 1
#define FM_HSSPI_MCTRL_AVAILABLE                  1
#define FM4_HSSPI_MID_AVAILABLE                   1
#define FM_HSSPI_MID_AVAILABLE                    1
#define FM4_HSSPI_PCC0_AVAILABLE                  1
#define FM_HSSPI_PCC0_AVAILABLE                   1
#define FM4_HSSPI_PCC1_AVAILABLE                  1
#define FM_HSSPI_PCC1_AVAILABLE                   1
#define FM4_HSSPI_PCC2_AVAILABLE                  1
#define FM_HSSPI_PCC2_AVAILABLE                   1
#define FM4_HSSPI_PCC3_AVAILABLE                  1
#define FM_HSSPI_PCC3_AVAILABLE                   1
#define FM4_HSSPI_QDCLKR_AVAILABLE                1
#define FM_HSSPI_QDCLKR_AVAILABLE                 1
#define FM4_HSSPI_RDCSDC0_AVAILABLE               1
#define FM_HSSPI_RDCSDC0_AVAILABLE                1
#define FM4_HSSPI_RDCSDC1_AVAILABLE               1
#define FM_HSSPI_RDCSDC1_AVAILABLE                1
#define FM4_HSSPI_RDCSDC2_AVAILABLE               1
#define FM_HSSPI_RDCSDC2_AVAILABLE                1
#define FM4_HSSPI_RDCSDC3_AVAILABLE               1
#define FM_HSSPI_RDCSDC3_AVAILABLE                1
#define FM4_HSSPI_RDCSDC4_AVAILABLE               1
#define FM_HSSPI_RDCSDC4_AVAILABLE                1
#define FM4_HSSPI_RDCSDC5_AVAILABLE               1
#define FM_HSSPI_RDCSDC5_AVAILABLE                1
#define FM4_HSSPI_RDCSDC6_AVAILABLE               1
#define FM_HSSPI_RDCSDC6_AVAILABLE                1
#define FM4_HSSPI_RDCSDC7_AVAILABLE               1
#define FM_HSSPI_RDCSDC7_AVAILABLE                1
#define FM4_HSSPI_RXC_AVAILABLE                   1
#define FM_HSSPI_RXC_AVAILABLE                    1
#define FM4_HSSPI_RXE_AVAILABLE                   1
#define FM_HSSPI_RXE_AVAILABLE                    1
#define FM4_HSSPI_RXF_AVAILABLE                   1
#define FM_HSSPI_RXF_AVAILABLE                    1
#define FM4_HSSPI_RXFIFO0_AVAILABLE               1
#define FM_HSSPI_RXFIFO0_AVAILABLE                1
#define FM4_HSSPI_RXFIFO1_AVAILABLE               1
#define FM_HSSPI_RXFIFO1_AVAILABLE                1
#define FM4_HSSPI_RXFIFO10_AVAILABLE              1
#define FM_HSSPI_RXFIFO10_AVAILABLE               1
#define FM4_HSSPI_RXFIFO11_AVAILABLE              1
#define FM_HSSPI_RXFIFO11_AVAILABLE               1
#define FM4_HSSPI_RXFIFO12_AVAILABLE              1
#define FM_HSSPI_RXFIFO12_AVAILABLE               1
#define FM4_HSSPI_RXFIFO13_AVAILABLE              1
#define FM_HSSPI_RXFIFO13_AVAILABLE               1
#define FM4_HSSPI_RXFIFO14_AVAILABLE              1
#define FM_HSSPI_RXFIFO14_AVAILABLE               1
#define FM4_HSSPI_RXFIFO15_AVAILABLE              1
#define FM_HSSPI_RXFIFO15_AVAILABLE               1
#define FM4_HSSPI_RXFIFO2_AVAILABLE               1
#define FM_HSSPI_RXFIFO2_AVAILABLE                1
#define FM4_HSSPI_RXFIFO3_AVAILABLE               1
#define FM_HSSPI_RXFIFO3_AVAILABLE                1
#define FM4_HSSPI_RXFIFO4_AVAILABLE               1
#define FM_HSSPI_RXFIFO4_AVAILABLE                1
#define FM4_HSSPI_RXFIFO5_AVAILABLE               1
#define FM_HSSPI_RXFIFO5_AVAILABLE                1
#define FM4_HSSPI_RXFIFO6_AVAILABLE               1
#define FM_HSSPI_RXFIFO6_AVAILABLE                1
#define FM4_HSSPI_RXFIFO7_AVAILABLE               1
#define FM_HSSPI_RXFIFO7_AVAILABLE                1
#define FM4_HSSPI_RXFIFO8_AVAILABLE               1
#define FM_HSSPI_RXFIFO8_AVAILABLE                1
#define FM4_HSSPI_RXFIFO9_AVAILABLE               1
#define FM_HSSPI_RXFIFO9_AVAILABLE                1
#define FM4_HSSPI_TXC_AVAILABLE                   1
#define FM_HSSPI_TXC_AVAILABLE                    1
#define FM4_HSSPI_TXE_AVAILABLE                   1
#define FM_HSSPI_TXE_AVAILABLE                    1
#define FM4_HSSPI_TXF_AVAILABLE                   1
#define FM_HSSPI_TXF_AVAILABLE                    1
#define FM4_HSSPI_TXFIFO0_AVAILABLE               1
#define FM_HSSPI_TXFIFO0_AVAILABLE                1
#define FM4_HSSPI_TXFIFO1_AVAILABLE               1
#define FM_HSSPI_TXFIFO1_AVAILABLE                1
#define FM4_HSSPI_TXFIFO10_AVAILABLE              1
#define FM_HSSPI_TXFIFO10_AVAILABLE               1
#define FM4_HSSPI_TXFIFO11_AVAILABLE              1
#define FM_HSSPI_TXFIFO11_AVAILABLE               1
#define FM4_HSSPI_TXFIFO12_AVAILABLE              1
#define FM_HSSPI_TXFIFO12_AVAILABLE               1
#define FM4_HSSPI_TXFIFO13_AVAILABLE              1
#define FM_HSSPI_TXFIFO13_AVAILABLE               1
#define FM4_HSSPI_TXFIFO14_AVAILABLE              1
#define FM_HSSPI_TXFIFO14_AVAILABLE               1
#define FM4_HSSPI_TXFIFO15_AVAILABLE              1
#define FM_HSSPI_TXFIFO15_AVAILABLE               1
#define FM4_HSSPI_TXFIFO2_AVAILABLE               1
#define FM_HSSPI_TXFIFO2_AVAILABLE                1
#define FM4_HSSPI_TXFIFO3_AVAILABLE               1
#define FM_HSSPI_TXFIFO3_AVAILABLE                1
#define FM4_HSSPI_TXFIFO4_AVAILABLE               1
#define FM_HSSPI_TXFIFO4_AVAILABLE                1
#define FM4_HSSPI_TXFIFO5_AVAILABLE               1
#define FM_HSSPI_TXFIFO5_AVAILABLE                1
#define FM4_HSSPI_TXFIFO6_AVAILABLE               1
#define FM_HSSPI_TXFIFO6_AVAILABLE                1
#define FM4_HSSPI_TXFIFO7_AVAILABLE               1
#define FM_HSSPI_TXFIFO7_AVAILABLE                1
#define FM4_HSSPI_TXFIFO8_AVAILABLE               1
#define FM_HSSPI_TXFIFO8_AVAILABLE                1
#define FM4_HSSPI_TXFIFO9_AVAILABLE               1
#define FM_HSSPI_TXFIFO9_AVAILABLE                1
#define FM4_HSSPI_WRCSDC0_AVAILABLE               1
#define FM_HSSPI_WRCSDC0_AVAILABLE                1
#define FM4_HSSPI_WRCSDC1_AVAILABLE               1
#define FM_HSSPI_WRCSDC1_AVAILABLE                1
#define FM4_HSSPI_WRCSDC2_AVAILABLE               1
#define FM_HSSPI_WRCSDC2_AVAILABLE                1
#define FM4_HSSPI_WRCSDC3_AVAILABLE               1
#define FM_HSSPI_WRCSDC3_AVAILABLE                1
#define FM4_HSSPI_WRCSDC4_AVAILABLE               1
#define FM_HSSPI_WRCSDC4_AVAILABLE                1
#define FM4_HSSPI_WRCSDC5_AVAILABLE               1
#define FM_HSSPI_WRCSDC5_AVAILABLE                1
#define FM4_HSSPI_WRCSDC6_AVAILABLE               1
#define FM_HSSPI_WRCSDC6_AVAILABLE                1
#define FM4_HSSPI_WRCSDC7_AVAILABLE               1
#define FM_HSSPI_WRCSDC7_AVAILABLE                1
/*******************************************************************************
* HWWDT
*******************************************************************************/
#define FM4_HWWDT_WDG_CTL_AVAILABLE               1
#define FM_HWWDT_WDG_CTL_AVAILABLE                1
#define FM4_HWWDT_WDG_ICL_AVAILABLE               1
#define FM_HWWDT_WDG_ICL_AVAILABLE                1
#define FM4_HWWDT_WDG_LCK_AVAILABLE               1
#define FM_HWWDT_WDG_LCK_AVAILABLE                1
#define FM4_HWWDT_WDG_LDR_AVAILABLE               1
#define FM_HWWDT_WDG_LDR_AVAILABLE                1
#define FM4_HWWDT_WDG_RIS_AVAILABLE               1
#define FM_HWWDT_WDG_RIS_AVAILABLE                1
#define FM4_HWWDT_WDG_VLR_AVAILABLE               1
#define FM_HWWDT_WDG_VLR_AVAILABLE                1
/*******************************************************************************
* I2S0
*******************************************************************************/
#define FM4_I2S_CNTREG_AVAILABLE                  1
#define FM_I2S_CNTREG_AVAILABLE                   1
#define FM4_I2S_DMAACT_AVAILABLE                  1
#define FM_I2S_DMAACT_AVAILABLE                   1
#define FM4_I2S_INTCNT_AVAILABLE                  1
#define FM_I2S_INTCNT_AVAILABLE                   1
#define FM4_I2S_MCR0REG_AVAILABLE                 1
#define FM_I2S_MCR0REG_AVAILABLE                  1
#define FM4_I2S_MCR1REG_AVAILABLE                 1
#define FM_I2S_MCR1REG_AVAILABLE                  1
#define FM4_I2S_MCR2REG_AVAILABLE                 1
#define FM_I2S_MCR2REG_AVAILABLE                  1
#define FM4_I2S_OPRREG_AVAILABLE                  1
#define FM_I2S_OPRREG_AVAILABLE                   1
#define FM4_I2S_RXFDAT_AVAILABLE                  1
#define FM_I2S_RXFDAT_AVAILABLE                   1
#define FM4_I2S_SRST_AVAILABLE                    1
#define FM_I2S_SRST_AVAILABLE                     1
#define FM4_I2S_STATUS_AVAILABLE                  1
#define FM_I2S_STATUS_AVAILABLE                   1
#define FM4_I2S_TSTREG_AVAILABLE                  1
#define FM_I2S_TSTREG_AVAILABLE                   1
#define FM4_I2S_TXFDAT_AVAILABLE                  1
#define FM_I2S_TXFDAT_AVAILABLE                   1
/*******************************************************************************
* I2SPRE
*******************************************************************************/
#define FM4_I2SPRE_ICCR_AVAILABLE                 1
#define FM_I2SPRE_ICCR_AVAILABLE                  1
#define FM4_I2SPRE_IP_STR_AVAILABLE               1
#define FM_I2SPRE_IP_STR_AVAILABLE                1
#define FM4_I2SPRE_IPCR1_AVAILABLE                1
#define FM_I2SPRE_IPCR1_AVAILABLE                 1
