mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xj/common/s6e2c4xj.h
#define bFM_I2S0_DMAACT_RDMACT                    *((volatile  uint8_t *)(0x42D80500UL))
#define bFM4_I2S0_DMAACT_RDMACT                   *((volatile  uint8_t *)(0x42D80500UL))
#define bFM_I2S0_DMAACT_RL1E0                     *((volatile  uint8_t *)(0x42D80520UL))
#define bFM4_I2S0_DMAACT_RL1E0                    *((volatile  uint8_t *)(0x42D80520UL))
#define bFM_I2S0_DMAACT_TDMACT                    *((volatile  uint8_t *)(0x42D80540UL))
#define bFM4_I2S0_DMAACT_TDMACT                   *((volatile  uint8_t *)(0x42D80540UL))
#define bFM_I2S0_DMAACT_TL1E0                     *((volatile  uint8_t *)(0x42D80560UL))
#define bFM4_I2S0_DMAACT_TL1E0                    *((volatile  uint8_t *)(0x42D80560UL))

#define bFM_I2S0_INTCNT_RXFIM                     *((volatile  uint8_t *)(0x42D80440UL))
#define bFM4_I2S0_INTCNT_RXFIM                    *((volatile  uint8_t *)(0x42D80440UL))
#define bFM_I2S0_INTCNT_RXFDM                     *((volatile  uint8_t *)(0x42D80444UL))
#define bFM4_I2S0_INTCNT_RXFDM                    *((volatile  uint8_t *)(0x42D80444UL))
#define bFM_I2S0_INTCNT_EOPM                      *((volatile  uint8_t *)(0x42D80448UL))
#define bFM4_I2S0_INTCNT_EOPM                     *((volatile  uint8_t *)(0x42D80448UL))
#define bFM_I2S0_INTCNT_RXOVM                     *((volatile  uint8_t *)(0x42D8044CUL))
#define bFM4_I2S0_INTCNT_RXOVM                    *((volatile  uint8_t *)(0x42D8044CUL))
#define bFM_I2S0_INTCNT_RXUDM                     *((volatile  uint8_t *)(0x42D80450UL))
#define bFM4_I2S0_INTCNT_RXUDM                    *((volatile  uint8_t *)(0x42D80450UL))
#define bFM_I2S0_INTCNT_RBERM                     *((volatile  uint8_t *)(0x42D80454UL))
#define bFM4_I2S0_INTCNT_RBERM                    *((volatile  uint8_t *)(0x42D80454UL))
#define bFM_I2S0_INTCNT_TXFIM                     *((volatile  uint8_t *)(0x42D80460UL))
#define bFM4_I2S0_INTCNT_TXFIM                    *((volatile  uint8_t *)(0x42D80460UL))
#define bFM_I2S0_INTCNT_TXFDM                     *((volatile  uint8_t *)(0x42D80464UL))
#define bFM4_I2S0_INTCNT_TXFDM                    *((volatile  uint8_t *)(0x42D80464UL))
#define bFM_I2S0_INTCNT_TXOVM                     *((volatile  uint8_t *)(0x42D80468UL))
#define bFM4_I2S0_INTCNT_TXOVM                    *((volatile  uint8_t *)(0x42D80468UL))
#define bFM_I2S0_INTCNT_TXUD0M                    *((volatile  uint8_t *)(0x42D8046CUL))
#define bFM4_I2S0_INTCNT_TXUD0M                   *((volatile  uint8_t *)(0x42D8046CUL))
#define bFM_I2S0_INTCNT_FERRM                     *((volatile  uint8_t *)(0x42D80470UL))
#define bFM4_I2S0_INTCNT_FERRM                    *((volatile  uint8_t *)(0x42D80470UL))
#define bFM_I2S0_INTCNT_TBERM                     *((volatile  uint8_t *)(0x42D80474UL))
#define bFM4_I2S0_INTCNT_TBERM                    *((volatile  uint8_t *)(0x42D80474UL))
#define bFM_I2S0_INTCNT_TXUD1M                    *((volatile  uint8_t *)(0x42D80478UL))
#define bFM4_I2S0_INTCNT_TXUD1M                   *((volatile  uint8_t *)(0x42D80478UL))

#define bFM_I2S0_MCR1REG_S0CH00                   *((volatile  uint8_t *)(0x42D80200UL))
#define bFM4_I2S0_MCR1REG_S0CH00                  *((volatile  uint8_t *)(0x42D80200UL))
#define bFM_I2S0_MCR1REG_S0CH01                   *((volatile  uint8_t *)(0x42D80204UL))
#define bFM4_I2S0_MCR1REG_S0CH01                  *((volatile  uint8_t *)(0x42D80204UL))
#define bFM_I2S0_MCR1REG_S0CH02                   *((volatile  uint8_t *)(0x42D80208UL))
#define bFM4_I2S0_MCR1REG_S0CH02                  *((volatile  uint8_t *)(0x42D80208UL))
#define bFM_I2S0_MCR1REG_S0CH03                   *((volatile  uint8_t *)(0x42D8020CUL))
#define bFM4_I2S0_MCR1REG_S0CH03                  *((volatile  uint8_t *)(0x42D8020CUL))
#define bFM_I2S0_MCR1REG_S0CH04                   *((volatile  uint8_t *)(0x42D80210UL))
#define bFM4_I2S0_MCR1REG_S0CH04                  *((volatile  uint8_t *)(0x42D80210UL))
#define bFM_I2S0_MCR1REG_S0CH05                   *((volatile  uint8_t *)(0x42D80214UL))
#define bFM4_I2S0_MCR1REG_S0CH05                  *((volatile  uint8_t *)(0x42D80214UL))
#define bFM_I2S0_MCR1REG_S0CH06                   *((volatile  uint8_t *)(0x42D80218UL))
#define bFM4_I2S0_MCR1REG_S0CH06                  *((volatile  uint8_t *)(0x42D80218UL))
#define bFM_I2S0_MCR1REG_S0CH07                   *((volatile  uint8_t *)(0x42D8021CUL))
#define bFM4_I2S0_MCR1REG_S0CH07                  *((volatile  uint8_t *)(0x42D8021CUL))
#define bFM_I2S0_MCR1REG_S0CH08                   *((volatile  uint8_t *)(0x42D80220UL))
#define bFM4_I2S0_MCR1REG_S0CH08                  *((volatile  uint8_t *)(0x42D80220UL))
#define bFM_I2S0_MCR1REG_S0CH09                   *((volatile  uint8_t *)(0x42D80224UL))
#define bFM4_I2S0_MCR1REG_S0CH09                  *((volatile  uint8_t *)(0x42D80224UL))
#define bFM_I2S0_MCR1REG_S0CH10                   *((volatile  uint8_t *)(0x42D80228UL))
#define bFM4_I2S0_MCR1REG_S0CH10                  *((volatile  uint8_t *)(0x42D80228UL))
#define bFM_I2S0_MCR1REG_S0CH11                   *((volatile  uint8_t *)(0x42D8022CUL))
#define bFM4_I2S0_MCR1REG_S0CH11                  *((volatile  uint8_t *)(0x42D8022CUL))
#define bFM_I2S0_MCR1REG_S0CH12                   *((volatile  uint8_t *)(0x42D80230UL))
#define bFM4_I2S0_MCR1REG_S0CH12                  *((volatile  uint8_t *)(0x42D80230UL))
#define bFM_I2S0_MCR1REG_S0CH13                   *((volatile  uint8_t *)(0x42D80234UL))
#define bFM4_I2S0_MCR1REG_S0CH13                  *((volatile  uint8_t *)(0x42D80234UL))
#define bFM_I2S0_MCR1REG_S0CH14                   *((volatile  uint8_t *)(0x42D80238UL))
#define bFM4_I2S0_MCR1REG_S0CH14                  *((volatile  uint8_t *)(0x42D80238UL))
#define bFM_I2S0_MCR1REG_S0CH15                   *((volatile  uint8_t *)(0x42D8023CUL))
#define bFM4_I2S0_MCR1REG_S0CH15                  *((volatile  uint8_t *)(0x42D8023CUL))
#define bFM_I2S0_MCR1REG_S0CH16                   *((volatile  uint8_t *)(0x42D80240UL))
#define bFM4_I2S0_MCR1REG_S0CH16                  *((volatile  uint8_t *)(0x42D80240UL))
#define bFM_I2S0_MCR1REG_S0CH17                   *((volatile  uint8_t *)(0x42D80244UL))
#define bFM4_I2S0_MCR1REG_S0CH17                  *((volatile  uint8_t *)(0x42D80244UL))
#define bFM_I2S0_MCR1REG_S0CH18                   *((volatile  uint8_t *)(0x42D80248UL))
#define bFM4_I2S0_MCR1REG_S0CH18                  *((volatile  uint8_t *)(0x42D80248UL))
#define bFM_I2S0_MCR1REG_S0CH19                   *((volatile  uint8_t *)(0x42D8024CUL))
#define bFM4_I2S0_MCR1REG_S0CH19                  *((volatile  uint8_t *)(0x42D8024CUL))
#define bFM_I2S0_MCR1REG_S0CH20                   *((volatile  uint8_t *)(0x42D80250UL))
#define bFM4_I2S0_MCR1REG_S0CH20                  *((volatile  uint8_t *)(0x42D80250UL))
#define bFM_I2S0_MCR1REG_S0CH21                   *((volatile  uint8_t *)(0x42D80254UL))
#define bFM4_I2S0_MCR1REG_S0CH21                  *((volatile  uint8_t *)(0x42D80254UL))
#define bFM_I2S0_MCR1REG_S0CH22                   *((volatile  uint8_t *)(0x42D80258UL))
#define bFM4_I2S0_MCR1REG_S0CH22                  *((volatile  uint8_t *)(0x42D80258UL))
#define bFM_I2S0_MCR1REG_S0CH23                   *((volatile  uint8_t *)(0x42D8025CUL))
#define bFM4_I2S0_MCR1REG_S0CH23                  *((volatile  uint8_t *)(0x42D8025CUL))
#define bFM_I2S0_MCR1REG_S0CH24                   *((volatile  uint8_t *)(0x42D80260UL))
#define bFM4_I2S0_MCR1REG_S0CH24                  *((volatile  uint8_t *)(0x42D80260UL))
#define bFM_I2S0_MCR1REG_S0CH25                   *((volatile  uint8_t *)(0x42D80264UL))
#define bFM4_I2S0_MCR1REG_S0CH25                  *((volatile  uint8_t *)(0x42D80264UL))
#define bFM_I2S0_MCR1REG_S0CH26                   *((volatile  uint8_t *)(0x42D80268UL))
#define bFM4_I2S0_MCR1REG_S0CH26                  *((volatile  uint8_t *)(0x42D80268UL))
#define bFM_I2S0_MCR1REG_S0CH27                   *((volatile  uint8_t *)(0x42D8026CUL))
#define bFM4_I2S0_MCR1REG_S0CH27                  *((volatile  uint8_t *)(0x42D8026CUL))
#define bFM_I2S0_MCR1REG_S0CH28                   *((volatile  uint8_t *)(0x42D80270UL))
#define bFM4_I2S0_MCR1REG_S0CH28                  *((volatile  uint8_t *)(0x42D80270UL))
#define bFM_I2S0_MCR1REG_S0CH29                   *((volatile  uint8_t *)(0x42D80274UL))
#define bFM4_I2S0_MCR1REG_S0CH29                  *((volatile  uint8_t *)(0x42D80274UL))
#define bFM_I2S0_MCR1REG_S0CH30                   *((volatile  uint8_t *)(0x42D80278UL))
#define bFM4_I2S0_MCR1REG_S0CH30                  *((volatile  uint8_t *)(0x42D80278UL))
#define bFM_I2S0_MCR1REG_S0CH31                   *((volatile  uint8_t *)(0x42D8027CUL))
#define bFM4_I2S0_MCR1REG_S0CH31                  *((volatile  uint8_t *)(0x42D8027CUL))

#define bFM_I2S0_MCR2REG_S1CH00                   *((volatile  uint8_t *)(0x42D80280UL))
#define bFM4_I2S0_MCR2REG_S1CH00                  *((volatile  uint8_t *)(0x42D80280UL))
#define bFM_I2S0_MCR2REG_S1CH01                   *((volatile  uint8_t *)(0x42D80284UL))
#define bFM4_I2S0_MCR2REG_S1CH01                  *((volatile  uint8_t *)(0x42D80284UL))
#define bFM_I2S0_MCR2REG_S1CH02                   *((volatile  uint8_t *)(0x42D80288UL))
#define bFM4_I2S0_MCR2REG_S1CH02                  *((volatile  uint8_t *)(0x42D80288UL))
#define bFM_I2S0_MCR2REG_S1CH03                   *((volatile  uint8_t *)(0x42D8028CUL))
#define bFM4_I2S0_MCR2REG_S1CH03                  *((volatile  uint8_t *)(0x42D8028CUL))
#define bFM_I2S0_MCR2REG_S1CH04                   *((volatile  uint8_t *)(0x42D80290UL))
#define bFM4_I2S0_MCR2REG_S1CH04                  *((volatile  uint8_t *)(0x42D80290UL))
#define bFM_I2S0_MCR2REG_S1CH05                   *((volatile  uint8_t *)(0x42D80294UL))
#define bFM4_I2S0_MCR2REG_S1CH05                  *((volatile  uint8_t *)(0x42D80294UL))
#define bFM_I2S0_MCR2REG_S1CH06                   *((volatile  uint8_t *)(0x42D80298UL))
#define bFM4_I2S0_MCR2REG_S1CH06                  *((volatile  uint8_t *)(0x42D80298UL))
#define bFM_I2S0_MCR2REG_S1CH07                   *((volatile  uint8_t *)(0x42D8029CUL))
#define bFM4_I2S0_MCR2REG_S1CH07                  *((volatile  uint8_t *)(0x42D8029CUL))
#define bFM_I2S0_MCR2REG_S1CH08                   *((volatile  uint8_t *)(0x42D802A0UL))
#define bFM4_I2S0_MCR2REG_S1CH08                  *((volatile  uint8_t *)(0x42D802A0UL))
#define bFM_I2S0_MCR2REG_S1CH09                   *((volatile  uint8_t *)(0x42D802A4UL))
#define bFM4_I2S0_MCR2REG_S1CH09                  *((volatile  uint8_t *)(0x42D802A4UL))
#define bFM_I2S0_MCR2REG_S1CH10                   *((volatile  uint8_t *)(0x42D802A8UL))
#define bFM4_I2S0_MCR2REG_S1CH10                  *((volatile  uint8_t *)(0x42D802A8UL))
#define bFM_I2S0_MCR2REG_S1CH11                   *((volatile  uint8_t *)(0x42D802ACUL))
#define bFM4_I2S0_MCR2REG_S1CH11                  *((volatile  uint8_t *)(0x42D802ACUL))
#define bFM_I2S0_MCR2REG_S1CH12                   *((volatile  uint8_t *)(0x42D802B0UL))
#define bFM4_I2S0_MCR2REG_S1CH12                  *((volatile  uint8_t *)(0x42D802B0UL))
#define bFM_I2S0_MCR2REG_S1CH13                   *((volatile  uint8_t *)(0x42D802B4UL))
#define bFM4_I2S0_MCR2REG_S1CH13                  *((volatile  uint8_t *)(0x42D802B4UL))
#define bFM_I2S0_MCR2REG_S1CH14                   *((volatile  uint8_t *)(0x42D802B8UL))
#define bFM4_I2S0_MCR2REG_S1CH14                  *((volatile  uint8_t *)(0x42D802B8UL))
#define bFM_I2S0_MCR2REG_S1CH15                   *((volatile  uint8_t *)(0x42D802BCUL))
#define bFM4_I2S0_MCR2REG_S1CH15                  *((volatile  uint8_t *)(0x42D802BCUL))
#define bFM_I2S0_MCR2REG_S1CH16                   *((volatile  uint8_t *)(0x42D802C0UL))
#define bFM4_I2S0_MCR2REG_S1CH16                  *((volatile  uint8_t *)(0x42D802C0UL))
#define bFM_I2S0_MCR2REG_S1CH17                   *((volatile  uint8_t *)(0x42D802C4UL))
#define bFM4_I2S0_MCR2REG_S1CH17                  *((volatile  uint8_t *)(0x42D802C4UL))
#define bFM_I2S0_MCR2REG_S1CH18                   *((volatile  uint8_t *)(0x42D802C8UL))
#define bFM4_I2S0_MCR2REG_S1CH18                  *((volatile  uint8_t *)(0x42D802C8UL))
#define bFM_I2S0_MCR2REG_S1CH19                   *((volatile  uint8_t *)(0x42D802CCUL))
#define bFM4_I2S0_MCR2REG_S1CH19                  *((volatile  uint8_t *)(0x42D802CCUL))
#define bFM_I2S0_MCR2REG_S1CH20                   *((volatile  uint8_t *)(0x42D802D0UL))
#define bFM4_I2S0_MCR2REG_S1CH20                  *((volatile  uint8_t *)(0x42D802D0UL))
#define bFM_I2S0_MCR2REG_S1CH21                   *((volatile  uint8_t *)(0x42D802D4UL))
#define bFM4_I2S0_MCR2REG_S1CH21                  *((volatile  uint8_t *)(0x42D802D4UL))
#define bFM_I2S0_MCR2REG_S1CH22                   *((volatile  uint8_t *)(0x42D802D8UL))
#define bFM4_I2S0_MCR2REG_S1CH22                  *((volatile  uint8_t *)(0x42D802D8UL))
#define bFM_I2S0_MCR2REG_S1CH23                   *((volatile  uint8_t *)(0x42D802DCUL))
#define bFM4_I2S0_MCR2REG_S1CH23                  *((volatile  uint8_t *)(0x42D802DCUL))
#define bFM_I2S0_MCR2REG_S1CH24                   *((volatile  uint8_t *)(0x42D802E0UL))
#define bFM4_I2S0_MCR2REG_S1CH24                  *((volatile  uint8_t *)(0x42D802E0UL))
#define bFM_I2S0_MCR2REG_S1CH25                   *((volatile  uint8_t *)(0x42D802E4UL))
#define bFM4_I2S0_MCR2REG_S1CH25                  *((volatile  uint8_t *)(0x42D802E4UL))
#define bFM_I2S0_MCR2REG_S1CH26                   *((volatile  uint8_t *)(0x42D802E8UL))
#define bFM4_I2S0_MCR2REG_S1CH26                  *((volatile  uint8_t *)(0x42D802E8UL))
#define bFM_I2S0_MCR2REG_S1CH27                   *((volatile  uint8_t *)(0x42D802ECUL))
#define bFM4_I2S0_MCR2REG_S1CH27                  *((volatile  uint8_t *)(0x42D802ECUL))
#define bFM_I2S0_MCR2REG_S1CH28                   *((volatile  uint8_t *)(0x42D802F0UL))
#define bFM4_I2S0_MCR2REG_S1CH28                  *((volatile  uint8_t *)(0x42D802F0UL))
#define bFM_I2S0_MCR2REG_S1CH29                   *((volatile  uint8_t *)(0x42D802F4UL))
#define bFM4_I2S0_MCR2REG_S1CH29                  *((volatile  uint8_t *)(0x42D802F4UL))
#define bFM_I2S0_MCR2REG_S1CH30                   *((volatile  uint8_t *)(0x42D802F8UL))
#define bFM4_I2S0_MCR2REG_S1CH30                  *((volatile  uint8_t *)(0x42D802F8UL))
#define bFM_I2S0_MCR2REG_S1CH31                   *((volatile  uint8_t *)(0x42D802FCUL))
#define bFM4_I2S0_MCR2REG_S1CH31                  *((volatile  uint8_t *)(0x42D802FCUL))

#define bFM_I2S0_OPRREG_START                     *((volatile  uint8_t *)(0x42D80300UL))
#define bFM4_I2S0_OPRREG_START                    *((volatile  uint8_t *)(0x42D80300UL))
#define bFM_I2S0_OPRREG_TXENB                     *((volatile  uint8_t *)(0x42D80340UL))
#define bFM4_I2S0_OPRREG_TXENB                    *((volatile  uint8_t *)(0x42D80340UL))
#define bFM_I2S0_OPRREG_RXENB                     *((volatile  uint8_t *)(0x42D80360UL))
#define bFM4_I2S0_OPRREG_RXENB                    *((volatile  uint8_t *)(0x42D80360UL))

#define bFM_I2S0_SRST_SRST                        *((volatile  uint8_t *)(0x42D80380UL))
#define bFM4_I2S0_SRST_SRST                       *((volatile  uint8_t *)(0x42D80380UL))

#define bFM_I2S0_STATUS_RXFI                      *((volatile  uint8_t *)(0x42D804C0UL))
#define bFM4_I2S0_STATUS_RXFI                     *((volatile  uint8_t *)(0x42D804C0UL))
#define bFM_I2S0_STATUS_TXFI                      *((volatile  uint8_t *)(0x42D804C4UL))
#define bFM4_I2S0_STATUS_TXFI                     *((volatile  uint8_t *)(0x42D804C4UL))
#define bFM_I2S0_STATUS_BSY                       *((volatile  uint8_t *)(0x42D804C8UL))
#define bFM4_I2S0_STATUS_BSY                      *((volatile  uint8_t *)(0x42D804C8UL))
#define bFM_I2S0_STATUS_EOPI                      *((volatile  uint8_t *)(0x42D804CCUL))
#define bFM4_I2S0_STATUS_EOPI                     *((volatile  uint8_t *)(0x42D804CCUL))
#define bFM_I2S0_STATUS_RXOVR                     *((volatile  uint8_t *)(0x42D804E0UL))
#define bFM4_I2S0_STATUS_RXOVR                    *((volatile  uint8_t *)(0x42D804E0UL))
#define bFM_I2S0_STATUS_RXUDR                     *((volatile  uint8_t *)(0x42D804E4UL))
#define bFM4_I2S0_STATUS_RXUDR                    *((volatile  uint8_t *)(0x42D804E4UL))
#define bFM_I2S0_STATUS_TXOVR                     *((volatile  uint8_t *)(0x42D804E8UL))
#define bFM4_I2S0_STATUS_TXOVR                    *((volatile  uint8_t *)(0x42D804E8UL))
#define bFM_I2S0_STATUS_TXUDR0                    *((volatile  uint8_t *)(0x42D804ECUL))
#define bFM4_I2S0_STATUS_TXUDR0                   *((volatile  uint8_t *)(0x42D804ECUL))
#define bFM_I2S0_STATUS_TXUDR1                    *((volatile  uint8_t *)(0x42D804F0UL))
#define bFM4_I2S0_STATUS_TXUDR1                   *((volatile  uint8_t *)(0x42D804F0UL))
#define bFM_I2S0_STATUS_FERR                      *((volatile  uint8_t *)(0x42D804F4UL))
#define bFM4_I2S0_STATUS_FERR                     *((volatile  uint8_t *)(0x42D804F4UL))
#define bFM_I2S0_STATUS_RBERR                     *((volatile  uint8_t *)(0x42D804F8UL))
#define bFM4_I2S0_STATUS_RBERR                    *((volatile  uint8_t *)(0x42D804F8UL))
#define bFM_I2S0_STATUS_TBERR                     *((volatile  uint8_t *)(0x42D804FCUL))
#define bFM4_I2S0_STATUS_TBERR                    *((volatile  uint8_t *)(0x42D804FCUL))

#define bFM_I2S0_TSTREG_LBMD                      *((volatile  uint8_t *)(0x42D80580UL))
#define bFM4_I2S0_TSTREG_LBMD                     *((volatile  uint8_t *)(0x42D80580UL))


