mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xj/common/s6e2c4xj.h
#define bFM_INTREQ_IRQ005MON_IRQBIT0              *((volatile  uint8_t *)(0x42624300UL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT0             *((volatile  uint8_t *)(0x42624300UL))
#define bFM_INTREQ_IRQ005MON_IRQBIT1              *((volatile  uint8_t *)(0x42624304UL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT1             *((volatile  uint8_t *)(0x42624304UL))
#define bFM_INTREQ_IRQ005MON_IRQBIT2              *((volatile  uint8_t *)(0x42624308UL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT2             *((volatile  uint8_t *)(0x42624308UL))
#define bFM_INTREQ_IRQ005MON_IRQBIT3              *((volatile  uint8_t *)(0x4262430CUL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT3             *((volatile  uint8_t *)(0x4262430CUL))
#define bFM_INTREQ_IRQ005MON_IRQBIT4              *((volatile  uint8_t *)(0x42624310UL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT4             *((volatile  uint8_t *)(0x42624310UL))
#define bFM_INTREQ_IRQ005MON_IRQBIT5              *((volatile  uint8_t *)(0x42624314UL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT5             *((volatile  uint8_t *)(0x42624314UL))
#define bFM_INTREQ_IRQ005MON_IRQBIT6              *((volatile  uint8_t *)(0x42624318UL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT6             *((volatile  uint8_t *)(0x42624318UL))
#define bFM_INTREQ_IRQ005MON_IRQBIT7              *((volatile  uint8_t *)(0x4262431CUL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT7             *((volatile  uint8_t *)(0x4262431CUL))

#define bFM_INTREQ_IRQ005SEL_SELBIT0              *((volatile  uint8_t *)(0x42622340UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT0             *((volatile  uint8_t *)(0x42622340UL))
#define bFM_INTREQ_IRQ005SEL_SELBIT1              *((volatile  uint8_t *)(0x42622344UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT1             *((volatile  uint8_t *)(0x42622344UL))
#define bFM_INTREQ_IRQ005SEL_SELBIT2              *((volatile  uint8_t *)(0x42622348UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT2             *((volatile  uint8_t *)(0x42622348UL))
#define bFM_INTREQ_IRQ005SEL_SELBIT3              *((volatile  uint8_t *)(0x4262234CUL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT3             *((volatile  uint8_t *)(0x4262234CUL))
#define bFM_INTREQ_IRQ005SEL_SELBIT4              *((volatile  uint8_t *)(0x42622350UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT4             *((volatile  uint8_t *)(0x42622350UL))
#define bFM_INTREQ_IRQ005SEL_SELBIT5              *((volatile  uint8_t *)(0x42622354UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT5             *((volatile  uint8_t *)(0x42622354UL))
#define bFM_INTREQ_IRQ005SEL_SELBIT6              *((volatile  uint8_t *)(0x42622358UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT6             *((volatile  uint8_t *)(0x42622358UL))
#define bFM_INTREQ_IRQ005SEL_SELBIT7              *((volatile  uint8_t *)(0x4262235CUL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT7             *((volatile  uint8_t *)(0x4262235CUL))
#define bFM_INTREQ_IRQ005SEL_SELBIT8              *((volatile  uint8_t *)(0x42622360UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT8             *((volatile  uint8_t *)(0x42622360UL))
#define bFM_INTREQ_IRQ005SEL_SELBIT9              *((volatile  uint8_t *)(0x42622364UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT9             *((volatile  uint8_t *)(0x42622364UL))
#define bFM_INTREQ_IRQ005SEL_SELBIT10             *((volatile  uint8_t *)(0x42622368UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT10            *((volatile  uint8_t *)(0x42622368UL))
#define bFM_INTREQ_IRQ005SEL_SELBIT11             *((volatile  uint8_t *)(0x4262236CUL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT11            *((volatile  uint8_t *)(0x4262236CUL))
#define bFM_INTREQ_IRQ005SEL_SELBIT12             *((volatile  uint8_t *)(0x42622370UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT12            *((volatile  uint8_t *)(0x42622370UL))
#define bFM_INTREQ_IRQ005SEL_SELBIT13             *((volatile  uint8_t *)(0x42622374UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT13            *((volatile  uint8_t *)(0x42622374UL))
#define bFM_INTREQ_IRQ005SEL_SELBIT14             *((volatile  uint8_t *)(0x42622378UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT14            *((volatile  uint8_t *)(0x42622378UL))
#define bFM_INTREQ_IRQ005SEL_SELBIT15             *((volatile  uint8_t *)(0x4262237CUL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT15            *((volatile  uint8_t *)(0x4262237CUL))

#define bFM_INTREQ_IRQ006MON_IRQBIT0              *((volatile  uint8_t *)(0x42624380UL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT0             *((volatile  uint8_t *)(0x42624380UL))
#define bFM_INTREQ_IRQ006MON_IRQBIT1              *((volatile  uint8_t *)(0x42624384UL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT1             *((volatile  uint8_t *)(0x42624384UL))
#define bFM_INTREQ_IRQ006MON_IRQBIT2              *((volatile  uint8_t *)(0x42624388UL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT2             *((volatile  uint8_t *)(0x42624388UL))
#define bFM_INTREQ_IRQ006MON_IRQBIT3              *((volatile  uint8_t *)(0x4262438CUL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT3             *((volatile  uint8_t *)(0x4262438CUL))
#define bFM_INTREQ_IRQ006MON_IRQBIT4              *((volatile  uint8_t *)(0x42624390UL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT4             *((volatile  uint8_t *)(0x42624390UL))
#define bFM_INTREQ_IRQ006MON_IRQBIT5              *((volatile  uint8_t *)(0x42624394UL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT5             *((volatile  uint8_t *)(0x42624394UL))
#define bFM_INTREQ_IRQ006MON_IRQBIT6              *((volatile  uint8_t *)(0x42624398UL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT6             *((volatile  uint8_t *)(0x42624398UL))
#define bFM_INTREQ_IRQ006MON_IRQBIT7              *((volatile  uint8_t *)(0x4262439CUL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT7             *((volatile  uint8_t *)(0x4262439CUL))

#define bFM_INTREQ_IRQ006SEL_SELBIT0              *((volatile  uint8_t *)(0x426223C0UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT0             *((volatile  uint8_t *)(0x426223C0UL))
#define bFM_INTREQ_IRQ006SEL_SELBIT1              *((volatile  uint8_t *)(0x426223C4UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT1             *((volatile  uint8_t *)(0x426223C4UL))
#define bFM_INTREQ_IRQ006SEL_SELBIT2              *((volatile  uint8_t *)(0x426223C8UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT2             *((volatile  uint8_t *)(0x426223C8UL))
#define bFM_INTREQ_IRQ006SEL_SELBIT3              *((volatile  uint8_t *)(0x426223CCUL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT3             *((volatile  uint8_t *)(0x426223CCUL))
#define bFM_INTREQ_IRQ006SEL_SELBIT4              *((volatile  uint8_t *)(0x426223D0UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT4             *((volatile  uint8_t *)(0x426223D0UL))
#define bFM_INTREQ_IRQ006SEL_SELBIT5              *((volatile  uint8_t *)(0x426223D4UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT5             *((volatile  uint8_t *)(0x426223D4UL))
#define bFM_INTREQ_IRQ006SEL_SELBIT6              *((volatile  uint8_t *)(0x426223D8UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT6             *((volatile  uint8_t *)(0x426223D8UL))
#define bFM_INTREQ_IRQ006SEL_SELBIT7              *((volatile  uint8_t *)(0x426223DCUL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT7             *((volatile  uint8_t *)(0x426223DCUL))
#define bFM_INTREQ_IRQ006SEL_SELBIT8              *((volatile  uint8_t *)(0x426223E0UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT8             *((volatile  uint8_t *)(0x426223E0UL))
#define bFM_INTREQ_IRQ006SEL_SELBIT9              *((volatile  uint8_t *)(0x426223E4UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT9             *((volatile  uint8_t *)(0x426223E4UL))
#define bFM_INTREQ_IRQ006SEL_SELBIT10             *((volatile  uint8_t *)(0x426223E8UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT10            *((volatile  uint8_t *)(0x426223E8UL))
#define bFM_INTREQ_IRQ006SEL_SELBIT11             *((volatile  uint8_t *)(0x426223ECUL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT11            *((volatile  uint8_t *)(0x426223ECUL))
#define bFM_INTREQ_IRQ006SEL_SELBIT12             *((volatile  uint8_t *)(0x426223F0UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT12            *((volatile  uint8_t *)(0x426223F0UL))
#define bFM_INTREQ_IRQ006SEL_SELBIT13             *((volatile  uint8_t *)(0x426223F4UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT13            *((volatile  uint8_t *)(0x426223F4UL))
#define bFM_INTREQ_IRQ006SEL_SELBIT14             *((volatile  uint8_t *)(0x426223F8UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT14            *((volatile  uint8_t *)(0x426223F8UL))
#define bFM_INTREQ_IRQ006SEL_SELBIT15             *((volatile  uint8_t *)(0x426223FCUL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT15            *((volatile  uint8_t *)(0x426223FCUL))

#define bFM_INTREQ_IRQ007MON_IRQBIT0              *((volatile  uint8_t *)(0x42624400UL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT0             *((volatile  uint8_t *)(0x42624400UL))
#define bFM_INTREQ_IRQ007MON_IRQBIT1              *((volatile  uint8_t *)(0x42624404UL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT1             *((volatile  uint8_t *)(0x42624404UL))
#define bFM_INTREQ_IRQ007MON_IRQBIT2              *((volatile  uint8_t *)(0x42624408UL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT2             *((volatile  uint8_t *)(0x42624408UL))
#define bFM_INTREQ_IRQ007MON_IRQBIT3              *((volatile  uint8_t *)(0x4262440CUL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT3             *((volatile  uint8_t *)(0x4262440CUL))
#define bFM_INTREQ_IRQ007MON_IRQBIT4              *((volatile  uint8_t *)(0x42624410UL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT4             *((volatile  uint8_t *)(0x42624410UL))
#define bFM_INTREQ_IRQ007MON_IRQBIT5              *((volatile  uint8_t *)(0x42624414UL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT5             *((volatile  uint8_t *)(0x42624414UL))
#define bFM_INTREQ_IRQ007MON_IRQBIT6              *((volatile  uint8_t *)(0x42624418UL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT6             *((volatile  uint8_t *)(0x42624418UL))
#define bFM_INTREQ_IRQ007MON_IRQBIT7              *((volatile  uint8_t *)(0x4262441CUL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT7             *((volatile  uint8_t *)(0x4262441CUL))

#define bFM_INTREQ_IRQ007SEL_SELBIT0              *((volatile  uint8_t *)(0x42622440UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT0             *((volatile  uint8_t *)(0x42622440UL))
#define bFM_INTREQ_IRQ007SEL_SELBIT1              *((volatile  uint8_t *)(0x42622444UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT1             *((volatile  uint8_t *)(0x42622444UL))
#define bFM_INTREQ_IRQ007SEL_SELBIT2              *((volatile  uint8_t *)(0x42622448UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT2             *((volatile  uint8_t *)(0x42622448UL))
#define bFM_INTREQ_IRQ007SEL_SELBIT3              *((volatile  uint8_t *)(0x4262244CUL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT3             *((volatile  uint8_t *)(0x4262244CUL))
#define bFM_INTREQ_IRQ007SEL_SELBIT4              *((volatile  uint8_t *)(0x42622450UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT4             *((volatile  uint8_t *)(0x42622450UL))
#define bFM_INTREQ_IRQ007SEL_SELBIT5              *((volatile  uint8_t *)(0x42622454UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT5             *((volatile  uint8_t *)(0x42622454UL))
#define bFM_INTREQ_IRQ007SEL_SELBIT6              *((volatile  uint8_t *)(0x42622458UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT6             *((volatile  uint8_t *)(0x42622458UL))
#define bFM_INTREQ_IRQ007SEL_SELBIT7              *((volatile  uint8_t *)(0x4262245CUL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT7             *((volatile  uint8_t *)(0x4262245CUL))
#define bFM_INTREQ_IRQ007SEL_SELBIT8              *((volatile  uint8_t *)(0x42622460UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT8             *((volatile  uint8_t *)(0x42622460UL))
#define bFM_INTREQ_IRQ007SEL_SELBIT9              *((volatile  uint8_t *)(0x42622464UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT9             *((volatile  uint8_t *)(0x42622464UL))
#define bFM_INTREQ_IRQ007SEL_SELBIT10             *((volatile  uint8_t *)(0x42622468UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT10            *((volatile  uint8_t *)(0x42622468UL))
#define bFM_INTREQ_IRQ007SEL_SELBIT11             *((volatile  uint8_t *)(0x4262246CUL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT11            *((volatile  uint8_t *)(0x4262246CUL))
#define bFM_INTREQ_IRQ007SEL_SELBIT12             *((volatile  uint8_t *)(0x42622470UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT12            *((volatile  uint8_t *)(0x42622470UL))
#define bFM_INTREQ_IRQ007SEL_SELBIT13             *((volatile  uint8_t *)(0x42622474UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT13            *((volatile  uint8_t *)(0x42622474UL))
#define bFM_INTREQ_IRQ007SEL_SELBIT14             *((volatile  uint8_t *)(0x42622478UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT14            *((volatile  uint8_t *)(0x42622478UL))
#define bFM_INTREQ_IRQ007SEL_SELBIT15             *((volatile  uint8_t *)(0x4262247CUL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT15            *((volatile  uint8_t *)(0x4262247CUL))

#define bFM_INTREQ_IRQ008MON_IRQBIT0              *((volatile  uint8_t *)(0x42624480UL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT0             *((volatile  uint8_t *)(0x42624480UL))
#define bFM_INTREQ_IRQ008MON_IRQBIT1              *((volatile  uint8_t *)(0x42624484UL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT1             *((volatile  uint8_t *)(0x42624484UL))
#define bFM_INTREQ_IRQ008MON_IRQBIT2              *((volatile  uint8_t *)(0x42624488UL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT2             *((volatile  uint8_t *)(0x42624488UL))
#define bFM_INTREQ_IRQ008MON_IRQBIT3              *((volatile  uint8_t *)(0x4262448CUL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT3             *((volatile  uint8_t *)(0x4262448CUL))
#define bFM_INTREQ_IRQ008MON_IRQBIT4              *((volatile  uint8_t *)(0x42624490UL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT4             *((volatile  uint8_t *)(0x42624490UL))
#define bFM_INTREQ_IRQ008MON_IRQBIT5              *((volatile  uint8_t *)(0x42624494UL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT5             *((volatile  uint8_t *)(0x42624494UL))
#define bFM_INTREQ_IRQ008MON_IRQBIT6              *((volatile  uint8_t *)(0x42624498UL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT6             *((volatile  uint8_t *)(0x42624498UL))
#define bFM_INTREQ_IRQ008MON_IRQBIT7              *((volatile  uint8_t *)(0x4262449CUL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT7             *((volatile  uint8_t *)(0x4262449CUL))

#define bFM_INTREQ_IRQ008SEL_SELBIT0              *((volatile  uint8_t *)(0x426224C0UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT0             *((volatile  uint8_t *)(0x426224C0UL))
#define bFM_INTREQ_IRQ008SEL_SELBIT1              *((volatile  uint8_t *)(0x426224C4UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT1             *((volatile  uint8_t *)(0x426224C4UL))
#define bFM_INTREQ_IRQ008SEL_SELBIT2              *((volatile  uint8_t *)(0x426224C8UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT2             *((volatile  uint8_t *)(0x426224C8UL))
#define bFM_INTREQ_IRQ008SEL_SELBIT3              *((volatile  uint8_t *)(0x426224CCUL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT3             *((volatile  uint8_t *)(0x426224CCUL))
#define bFM_INTREQ_IRQ008SEL_SELBIT4              *((volatile  uint8_t *)(0x426224D0UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT4             *((volatile  uint8_t *)(0x426224D0UL))
#define bFM_INTREQ_IRQ008SEL_SELBIT5              *((volatile  uint8_t *)(0x426224D4UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT5             *((volatile  uint8_t *)(0x426224D4UL))
#define bFM_INTREQ_IRQ008SEL_SELBIT6              *((volatile  uint8_t *)(0x426224D8UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT6             *((volatile  uint8_t *)(0x426224D8UL))
#define bFM_INTREQ_IRQ008SEL_SELBIT7              *((volatile  uint8_t *)(0x426224DCUL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT7             *((volatile  uint8_t *)(0x426224DCUL))
#define bFM_INTREQ_IRQ008SEL_SELBIT8              *((volatile  uint8_t *)(0x426224E0UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT8             *((volatile  uint8_t *)(0x426224E0UL))
#define bFM_INTREQ_IRQ008SEL_SELBIT9              *((volatile  uint8_t *)(0x426224E4UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT9             *((volatile  uint8_t *)(0x426224E4UL))
#define bFM_INTREQ_IRQ008SEL_SELBIT10             *((volatile  uint8_t *)(0x426224E8UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT10            *((volatile  uint8_t *)(0x426224E8UL))
#define bFM_INTREQ_IRQ008SEL_SELBIT11             *((volatile  uint8_t *)(0x426224ECUL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT11            *((volatile  uint8_t *)(0x426224ECUL))
#define bFM_INTREQ_IRQ008SEL_SELBIT12             *((volatile  uint8_t *)(0x426224F0UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT12            *((volatile  uint8_t *)(0x426224F0UL))
#define bFM_INTREQ_IRQ008SEL_SELBIT13             *((volatile  uint8_t *)(0x426224F4UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT13            *((volatile  uint8_t *)(0x426224F4UL))
#define bFM_INTREQ_IRQ008SEL_SELBIT14             *((volatile  uint8_t *)(0x426224F8UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT14            *((volatile  uint8_t *)(0x426224F8UL))
#define bFM_INTREQ_IRQ008SEL_SELBIT15             *((volatile  uint8_t *)(0x426224FCUL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT15            *((volatile  uint8_t *)(0x426224FCUL))

#define bFM_INTREQ_IRQ009MON_IRQBIT0              *((volatile  uint8_t *)(0x42624500UL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT0             *((volatile  uint8_t *)(0x42624500UL))
#define bFM_INTREQ_IRQ009MON_IRQBIT1              *((volatile  uint8_t *)(0x42624504UL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT1             *((volatile  uint8_t *)(0x42624504UL))
#define bFM_INTREQ_IRQ009MON_IRQBIT2              *((volatile  uint8_t *)(0x42624508UL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT2             *((volatile  uint8_t *)(0x42624508UL))
#define bFM_INTREQ_IRQ009MON_IRQBIT3              *((volatile  uint8_t *)(0x4262450CUL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT3             *((volatile  uint8_t *)(0x4262450CUL))
#define bFM_INTREQ_IRQ009MON_IRQBIT4              *((volatile  uint8_t *)(0x42624510UL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT4             *((volatile  uint8_t *)(0x42624510UL))
#define bFM_INTREQ_IRQ009MON_IRQBIT5              *((volatile  uint8_t *)(0x42624514UL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT5             *((volatile  uint8_t *)(0x42624514UL))
#define bFM_INTREQ_IRQ009MON_IRQBIT6              *((volatile  uint8_t *)(0x42624518UL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT6             *((volatile  uint8_t *)(0x42624518UL))
#define bFM_INTREQ_IRQ009MON_IRQBIT7              *((volatile  uint8_t *)(0x4262451CUL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT7             *((volatile  uint8_t *)(0x4262451CUL))

#define bFM_INTREQ_IRQ009SEL_SELBIT0              *((volatile  uint8_t *)(0x42622540UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT0             *((volatile  uint8_t *)(0x42622540UL))
#define bFM_INTREQ_IRQ009SEL_SELBIT1              *((volatile  uint8_t *)(0x42622544UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT1             *((volatile  uint8_t *)(0x42622544UL))
#define bFM_INTREQ_IRQ009SEL_SELBIT2              *((volatile  uint8_t *)(0x42622548UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT2             *((volatile  uint8_t *)(0x42622548UL))
#define bFM_INTREQ_IRQ009SEL_SELBIT3              *((volatile  uint8_t *)(0x4262254CUL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT3             *((volatile  uint8_t *)(0x4262254CUL))
#define bFM_INTREQ_IRQ009SEL_SELBIT4              *((volatile  uint8_t *)(0x42622550UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT4             *((volatile  uint8_t *)(0x42622550UL))
#define bFM_INTREQ_IRQ009SEL_SELBIT5              *((volatile  uint8_t *)(0x42622554UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT5             *((volatile  uint8_t *)(0x42622554UL))
#define bFM_INTREQ_IRQ009SEL_SELBIT6              *((volatile  uint8_t *)(0x42622558UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT6             *((volatile  uint8_t *)(0x42622558UL))
#define bFM_INTREQ_IRQ009SEL_SELBIT7              *((volatile  uint8_t *)(0x4262255CUL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT7             *((volatile  uint8_t *)(0x4262255CUL))
#define bFM_INTREQ_IRQ009SEL_SELBIT8              *((volatile  uint8_t *)(0x42622560UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT8             *((volatile  uint8_t *)(0x42622560UL))
#define bFM_INTREQ_IRQ009SEL_SELBIT9              *((volatile  uint8_t *)(0x42622564UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT9             *((volatile  uint8_t *)(0x42622564UL))
#define bFM_INTREQ_IRQ009SEL_SELBIT10             *((volatile  uint8_t *)(0x42622568UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT10            *((volatile  uint8_t *)(0x42622568UL))
#define bFM_INTREQ_IRQ009SEL_SELBIT11             *((volatile  uint8_t *)(0x4262256CUL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT11            *((volatile  uint8_t *)(0x4262256CUL))
#define bFM_INTREQ_IRQ009SEL_SELBIT12             *((volatile  uint8_t *)(0x42622570UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT12            *((volatile  uint8_t *)(0x42622570UL))
#define bFM_INTREQ_IRQ009SEL_SELBIT13             *((volatile  uint8_t *)(0x42622574UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT13            *((volatile  uint8_t *)(0x42622574UL))
#define bFM_INTREQ_IRQ009SEL_SELBIT14             *((volatile  uint8_t *)(0x42622578UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT14            *((volatile  uint8_t *)(0x42622578UL))
#define bFM_INTREQ_IRQ009SEL_SELBIT15             *((volatile  uint8_t *)(0x4262257CUL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT15            *((volatile  uint8_t *)(0x4262257CUL))

#define bFM_INTREQ_IRQ010MON_IRQBIT0              *((volatile  uint8_t *)(0x42624580UL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT0             *((volatile  uint8_t *)(0x42624580UL))
#define bFM_INTREQ_IRQ010MON_IRQBIT1              *((volatile  uint8_t *)(0x42624584UL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT1             *((volatile  uint8_t *)(0x42624584UL))
#define bFM_INTREQ_IRQ010MON_IRQBIT2              *((volatile  uint8_t *)(0x42624588UL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT2             *((volatile  uint8_t *)(0x42624588UL))
#define bFM_INTREQ_IRQ010MON_IRQBIT3              *((volatile  uint8_t *)(0x4262458CUL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT3             *((volatile  uint8_t *)(0x4262458CUL))
#define bFM_INTREQ_IRQ010MON_IRQBIT4              *((volatile  uint8_t *)(0x42624590UL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT4             *((volatile  uint8_t *)(0x42624590UL))
#define bFM_INTREQ_IRQ010MON_IRQBIT5              *((volatile  uint8_t *)(0x42624594UL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT5             *((volatile  uint8_t *)(0x42624594UL))
#define bFM_INTREQ_IRQ010MON_IRQBIT6              *((volatile  uint8_t *)(0x42624598UL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT6             *((volatile  uint8_t *)(0x42624598UL))
#define bFM_INTREQ_IRQ010MON_IRQBIT7              *((volatile  uint8_t *)(0x4262459CUL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT7             *((volatile  uint8_t *)(0x4262459CUL))

